FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
/********************************************************************************
 *
 * Device     : RX/RX700/RX71M
 *
 * File Name  : iodefine.h
 *
 * Abstract   : Definition of I/O Register
 *
 * History    : 0.10  (2014-03-22)  [Hardware Manual Revision : 0.10]
 *            : 1.00  (2014-12-08)  [Hardware Manual Revision : 1.00]
 *
 * Note       : THIS IS A TYPICAL EXAMPLE.
 *
 * Copyright (C) 2014 Renesas Electronics Corporation.
 *
 *********************************************************************************/
/*                                                                              */
/*  DESCRIPTION : Definition of ICU Register                                    */
/*  CPU TYPE    : RX71M                                                         */
/*                                                                              */
/*  Usage : IR,DTCER,IER,IPR of ICU Register                                    */
/*     The following IR, DTCE, IEN, IPR macro functions simplify usage.         */
/*     The bit access operation is "Bit_Name(interrupt source,name)".           */
/*     A part of the name can be omitted.                                       */
/*     for example :                                                            */
/*       IR(BSC,BUSERR) = 0;     expands to :                                   */
/*         ICU.IR[16].BIT.IR = 0;                                               */
/*                                                                              */
/*       DTCE(ICU,IRQ0) = 1;     expands to :                                   */
/*         ICU.DTCER[64].BIT.DTCE = 1;                                          */
/*                                                                              */
/*       IEN(CMT0,CMI0) = 1;     expands to :                                   */
/*         ICU.IER[0x03].BIT.IEN4 = 1;                                          */
/*                                                                              */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)                      */
/*     The number of vector is "(interrupt source, name)".                      */
/*     for example :                                                            */
/*       #pragma interrupt INT_IRQ0(vect=VECT(ICU,IRQ0))          expands to :  */
/*         #pragma interrupt INT_IRQ0(vect=64)                                  */
/*       #pragma interrupt INT_CMT0_CMI0(vect=VECT(CMT0,CMI0))    expands to :  */
/*         #pragma interrupt INT_CMT0_CMI0(vect=28)                             */
/*                                                                              */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC of SYSTEM Register                          */
/*     The bit access operation is "MSTP(name)".                                */
/*     The name that can be used is a macro name defined with "iodefine.h".     */
/*     for example :                                                            */
/*       MSTP(TMR2) = 0;    // TMR2,TMR3,TMR23                    expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA4  = 0;                                      */
/*       MSTP(SCI0) = 0;    // SCI0,SMCI0                         expands to :  */
/*         SYSTEM.MSTPCRB.BIT.MSTPB31 = 0;                                      */
/*       MSTP(MTU4) = 0;    // MTU,MTU0,MTU1,MTU2,MTU3,MTU4,...   expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA9  = 0;                                      */
/*       MSTP(TPU4) = 0;    // TPU0,TPU1,TPU2,TPU3,TPU4,TPU5      expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA13 = 0;                                      */
/*       MSTP(CMT3) = 0;    // CMT2,CMT3                          expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA14 = 0;                                      */
/*                                                                              */
/*                                                                              */
/********************************************************************************/
#ifndef __RX71MIODEFINE_HEADER__
#define __RX71MIODEFINE_HEADER__
#pragma bit_order left
#pragma unpack
struct st_bsc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char STSCLR : 1;
        }
        BIT;
    }
    BERCLR;
    char wk0[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TOEN : 1;
            unsigned char IGAEN : 1;
        }
        BIT;
    }
    BEREN;
    char wk1[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char MST : 3;
            unsigned char : 2;
            unsigned char TO : 1;
            unsigned char IA : 1;
        }
        BIT;
    }
    BERSR1;
    char wk2[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADDR : 13;
        }
        BIT;
    }
    BERSR2;
    char wk3[ 4 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short BPEB : 2;
            unsigned short BPFB : 2;
            unsigned short BPHB : 2;
            unsigned short BPGB : 2;
            unsigned short BPIB : 2;
            unsigned short BPRO : 2;
            unsigned short BPRA : 2;
        }
        BIT;
    }
    BUSPRI;
    char wk4[ 7408 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS0MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS0WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS0WCR2;
    char wk5[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS1MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS1WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS1WCR2;
    char wk6[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS2MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS2WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS2WCR2;
    char wk7[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS3MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS3WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS3WCR2;
    char wk8[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS4MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS4WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS4WCR2;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS5MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS5WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS5WCR2;
    char wk10[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS6MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS6WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS6WCR2;
    char wk11[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        }
        BIT;
    }
    CS7MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        }
        BIT;
    }
    CS7WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        }
        BIT;
    }
    CS7WCR2;
    char wk12[ 1926 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS0CR;
    char wk13[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS0REC;
    char wk14[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS1CR;
    char wk15[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS1REC;
    char wk16[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS2CR;
    char wk17[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS2REC;
    char wk18[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS3CR;
    char wk19[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS3REC;
    char wk20[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS4CR;
    char wk21[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS4REC;
    char wk22[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS5CR;
    char wk23[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS5REC;
    char wk24[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS6CR;
    char wk25[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS6REC;
    char wk26[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        }
        BIT;
    }
    CS7CR;
    char wk27[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        }
        BIT;
    }
    CS7REC;
    char wk28[ 4 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RCVENM7 : 1;
            unsigned short RCVENM6 : 1;
            unsigned short RCVENM5 : 1;
            unsigned short RCVENM4 : 1;
            unsigned short RCVENM3 : 1;
            unsigned short RCVENM2 : 1;
            unsigned short RCVENM1 : 1;
            unsigned short RCVENM0 : 1;
            unsigned short RCVEN7 : 1;
            unsigned short RCVEN6 : 1;
            unsigned short RCVEN5 : 1;
            unsigned short RCVEN4 : 1;
            unsigned short RCVEN3 : 1;
            unsigned short RCVEN2 : 1;
            unsigned short RCVEN1 : 1;
            unsigned short RCVEN0 : 1;
        }
        BIT;
    }
    CSRECEN;
    char wk29[ 894 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BSIZE : 2;
            unsigned char : 3;
            unsigned char EXENB : 1;
        }
        BIT;
    }
    SDCCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char EMODE : 1;
        }
        BIT;
    }
    SDCMOD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char BE : 1;
        }
