FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
        BIT;
    }
    SDAMOD;
    char wk30[ 13 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SFEN : 1;
        }
        BIT;
    }
    SDSELF;
    char wk31[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short REFW : 4;
            unsigned short RFC : 12;
        }
        BIT;
    }
    SDRFCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RFEN : 1;
        }
        BIT;
    }
    SDRFEN;
    char wk32[ 9 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char INIRQ : 1;
        }
        BIT;
    }
    SDICR;
    char wk33[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short PRC : 3;
            unsigned short ARFC : 4;
            unsigned short ARFI : 4;
        }
        BIT;
    }
    SDIR;
    char wk34[ 26 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MXC : 2;
        }
        BIT;
    }
    SDADR;
    char wk35[ 3 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long RAS : 3;
            unsigned long : 2;
            unsigned long RCD : 2;
            unsigned long RP : 3;
            unsigned long WR : 1;
            unsigned long : 5;
            unsigned long CL : 3;
        }
        BIT;
    }
    SDTR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 1;
            unsigned short MR : 15;
        }
        BIT;
    }
    SDMOD;
    char wk36[ 6 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char SRFST : 1;
            unsigned char INIST : 1;
            unsigned char : 2;
            unsigned char MRSST : 1;
        }
        BIT;
    }
    SDSR;
};

struct st_cac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char CFME : 1;
        }
        BIT;
    }
    CACR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EDGES : 2;
            unsigned char TCSS : 2;
            unsigned char FMCS : 3;
            unsigned char CACREFE : 1;
        }
        BIT;
    }
    CACR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DFS : 2;
            unsigned char RCDS : 2;
            unsigned char RSCS : 3;
            unsigned char RPS : 1;
        }
        BIT;
    }
    CACR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char OVFFCL : 1;
            unsigned char MENDFCL : 1;
            unsigned char FERRFCL : 1;
            unsigned char : 1;
            unsigned char OVFIE : 1;
            unsigned char MENDIE : 1;
            unsigned char FERRIE : 1;
        }
        BIT;
    }
    CAICR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char OVFF : 1;
            unsigned char MENDF : 1;
            unsigned char FERRF : 1;
        }
        BIT;
    }
    CASTR;
    char wk0[ 1 ];
    unsigned short CAULVR;
    unsigned short CALLVR;
    unsigned short CACNTBR;
};

struct st_can
{
    struct
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned short H;
                unsigned short L;
            }
            WORD;
            struct
            {
                unsigned char HH;
                unsigned char HL;
                unsigned char LH;
                unsigned char LL;
            }
            BYTE;
            struct
            {
                unsigned long IDE : 1;
                unsigned long RTR : 1;
                unsigned long : 1;
                unsigned long SID : 11;
                unsigned long EID : 18;
            }
            BIT;
        }
        ID;
        unsigned short DLC;
        unsigned char DATA[ 8 ];
        unsigned short TS;
    }
    MB[ 32 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long : 3;
            unsigned long SID : 11;
            unsigned long EID : 18;
        }
        BIT;
    }
    MKR[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long IDE : 1;
            unsigned long RTR : 1;
            unsigned long : 1;
            unsigned long SID : 11;
            unsigned long EID : 18;
        }
        BIT;
    }
    FIDCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long IDE : 1;
            unsigned long RTR : 1;
            unsigned long : 1;
            unsigned long SID : 11;
            unsigned long EID : 18;
        }
        BIT;
    }
    FIDCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned char MB31 : 1;
            unsigned char MB30 : 1;
            unsigned char MB29 : 1;
            unsigned char MB28 : 1;
            unsigned char MB27 : 1;
            unsigned char MB26 : 1;
            unsigned char MB25 : 1;
            unsigned char MB24 : 1;
            unsigned char MB23 : 1;
            unsigned char MB22 : 1;
            unsigned char MB21 : 1;
            unsigned char MB20 : 1;
            unsigned char MB19 : 1;
            unsigned char MB18 : 1;
            unsigned char MB17 : 1;
            unsigned char MB16 : 1;
            unsigned char MB15 : 1;
            unsigned char MB14 : 1;
            unsigned char MB13 : 1;
            unsigned char MB12 : 1;
            unsigned char MB11 : 1;
            unsigned char MB10 : 1;
            unsigned char MB9 : 1;
            unsigned char MB8 : 1;
            unsigned char MB7 : 1;
            unsigned char MB6 : 1;
            unsigned char MB5 : 1;
            unsigned char MB4 : 1;
            unsigned char MB3 : 1;
            unsigned char MB2 : 1;
            unsigned char MB1 : 1;
            unsigned char MB0 : 1;
        }
        BIT;
    }
    MKIVLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned char MB31 : 1;
            unsigned char MB30 : 1;
            unsigned char MB29 : 1;
            unsigned char MB28 : 1;
            unsigned char MB27 : 1;
            unsigned char MB26 : 1;
            unsigned char MB25 : 1;
            unsigned char MB24 : 1;
            unsigned char MB23 : 1;
            unsigned char MB22 : 1;
            unsigned char MB21 : 1;
            unsigned char MB20 : 1;
            unsigned char MB19 : 1;
            unsigned char MB18 : 1;
            unsigned char MB17 : 1;
            unsigned char MB16 : 1;
            unsigned char MB15 : 1;
            unsigned char MB14 : 1;
            unsigned char MB13 : 1;
            unsigned char MB12 : 1;
            unsigned char MB11 : 1;
            unsigned char MB10 : 1;
            unsigned char MB9 : 1;
            unsigned char MB8 : 1;
            unsigned char MB7 : 1;
            unsigned char MB6 : 1;
            unsigned char MB5 : 1;
            unsigned char MB4 : 1;
            unsigned char MB3 : 1;
            unsigned char MB2 : 1;
            unsigned char MB1 : 1;
            unsigned char MB0 : 1;
        }
        BIT;
    }
    MIER;
    char wk0[ 1008 ];
    union
    {
        unsigned char BYTE;
        union
        {
            struct
            {
                unsigned char TRMREQ : 1;
                unsigned char RECREQ : 1;
                unsigned char : 1;
                unsigned char ONESHOT : 1;
                unsigned char : 1;
                unsigned char TRMABT : 1;
                unsigned char TRMACTIVE : 1;
                unsigned char SENTDATA : 1;
            }
            TX;
            struct
            {
                unsigned char TRMREQ : 1;
                unsigned char RECREQ : 1;
                unsigned char : 1;
                unsigned char ONESHOT : 1;
                unsigned char : 1;
                unsigned char MSGLOST : 1;
                unsigned char INVALDATA : 1;
                unsigned char NEWDATA : 1;
            }
            RX;
        }
        BIT;
    }
    MCTL[ 32 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        }
        BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char RBOC : 1;
            unsigned char BOM : 2;
            unsigned char SLPM : 1;
            unsigned char CANM : 2;
            unsigned char TSPS : 2;
            unsigned char TSRC : 1;
            unsigned char TPM : 1;
            unsigned char MLM : 1;
            unsigned char IDFM : 2;
            unsigned char MBM : 1;
        }
        BIT;
    }
    CTLR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        }
        BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char RECST : 1;
            unsigned char TRMST : 1;
            unsigned char BOST : 1;
            unsigned char EPST : 1;
            unsigned char SLPST : 1;
            unsigned char HLTST : 1;
            unsigned char RSTST : 1;
            unsigned char EST : 1;
            unsigned char TABST : 1;
            unsigned char FMLST : 1;
            unsigned char NMLST : 1;
            unsigned char TFST : 1;
            unsigned char RFST : 1;
            unsigned char SDST : 1;
            unsigned char NDST : 1;
        }
        BIT;
    }
    STR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long TSEG1 : 4;
            unsigned long : 2;
            unsigned long BRP : 10;
            unsigned long : 2;
            unsigned long SJW : 2;
            unsigned long : 1;
            unsigned long TSEG2 : 3;
            unsigned long : 7;
            unsigned long CCLKS : 1;
        }
        BIT;
    }
    BCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RFEST : 1;
            unsigned char RFWST : 1;
            unsigned char RFFST : 1;
            unsigned char RFMLF : 1;
            unsigned char RFUST : 3;
            unsigned char RFE : 1;
        }
        BIT;
    }
    RFCR;
    unsigned char RFPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TFEST : 1;
            unsigned char TFFST : 1;
            unsigned char : 2;
            unsigned char TFUST : 3;
            unsigned char TFE : 1;
        }
        BIT;
    }
    TFCR;
    unsigned char TFPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BLIE : 1;
            unsigned char OLIE : 1;
            unsigned char ORIE : 1;
            unsigned char BORIE : 1;
            unsigned char BOEIE : 1;
            unsigned char EPIE : 1;
            unsigned char EWIE : 1;
            unsigned char BEIE : 1;
        }
        BIT;
    }
    EIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BLIF : 1;
            unsigned char OLIF : 1;
            unsigned char ORIF : 1;
            unsigned char BORIF : 1;
            unsigned char BOEIF : 1;
            unsigned char EPIF : 1;
            unsigned char EWIF : 1;
            unsigned char BEIF : 1;
        }
        BIT;
    }
    EIFR;
    unsigned char RECR;
    unsigned char TECR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EDPM : 1;
            unsigned char ADEF : 1;
            unsigned char BE0F : 1;
            unsigned char BE1F : 1;
            unsigned char CEF : 1;
            unsigned char AEF : 1;
            unsigned char FEF : 1;
            unsigned char SEF : 1;
        }
        BIT;
    }
    ECSR;
    unsigned char CSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SEST : 1;
            unsigned char : 2;
            unsigned char MBNST : 5;
        }
        BIT;
    }
    MSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MBSM : 2;
        }
        BIT;
    }
    MSMR;
    unsigned short TSR;
    unsigned short AFSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TSTM : 2;
            unsigned char TSTE : 1;
        }
        BIT;
    }
    TCR;
};

