FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_elc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELCON : 1;
        }
        BIT;
    }
    ELCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR0;
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR4;
    char wk1[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR7;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR10;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR11;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR12;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR13;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR15;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR16;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR18;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR19;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR20;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR21;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR22;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR23;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR24;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR25;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR26;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR27;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR28;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char MTU3MD : 2;
            unsigned char : 4;
            unsigned char MTU0MD : 2;
        }
        BIT;
    }
    ELOPA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MTU4MD : 2;
        }
        BIT;
    }
    ELOPB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char CMT1MD : 2;
        }
        BIT;
    }
    ELOPC;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TMR3MD : 2;
            unsigned char TMR2MD : 2;
            unsigned char TMR1MD : 2;
            unsigned char TMR0MD : 2;
        }
        BIT;
    }
    ELOPD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PGR7 : 1;
            unsigned char PGR6 : 1;
            unsigned char PGR5 : 1;
            unsigned char PGR4 : 1;
            unsigned char PGR3 : 1;
            unsigned char PGR2 : 1;
            unsigned char PGR1 : 1;
            unsigned char PGR0 : 1;
        }
        BIT;
    }
    PGR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PGR7 : 1;
            unsigned char PGR6 : 1;
            unsigned char PGR5 : 1;
            unsigned char PGR4 : 1;
            unsigned char PGR3 : 1;
            unsigned char PGR2 : 1;
            unsigned char PGR1 : 1;
            unsigned char PGR0 : 1;
        }
        BIT;
    }
    PGR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PGCO : 3;
            unsigned char : 1;
            unsigned char PGCOVE : 1;
            unsigned char PGCI : 2;
        }
        BIT;
    }
    PGC1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PGCO : 3;
            unsigned char : 1;
            unsigned char PGCOVE : 1;
            unsigned char PGCI : 2;
        }
        BIT;
    }
    PGC2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PDBF7 : 1;
            unsigned char PDBF6 : 1;
            unsigned char PDBF5 : 1;
            unsigned char PDBF4 : 1;
            unsigned char PDBF3 : 1;
            unsigned char PDBF2 : 1;
            unsigned char PDBF1 : 1;
            unsigned char PDBF0 : 1;
        }
        BIT;
    }
    PDBF1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PDBF7 : 1;
            unsigned char PDBF6 : 1;
            unsigned char PDBF5 : 1;
            unsigned char PDBF4 : 1;
            unsigned char PDBF3 : 1;
            unsigned char PDBF2 : 1;
            unsigned char PDBF1 : 1;
            unsigned char PDBF0 : 1;
        }
        BIT;
    }
    PDBF2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        }
        BIT;
    }
    PEL0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        }
        BIT;
    }
    PEL1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        }
        BIT;
    }
    PEL2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        }
        BIT;
    }
    PEL3;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char WI:1; */
/*			unsigned char WE:1; */
/*			unsigned char :5; */
/*			unsigned char SEG:1; */
/*		} BIT; */
    }
    ELSEGR;
    char wk6[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR33;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR35;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR36;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR37;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR38;
    char wk8[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR41;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR42;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR43;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR44;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        }
        BIT;
    }
    ELSR45;
    char wk9[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TPU3MD : 2;
            unsigned char TPU2MD : 2;
            unsigned char TPU1MD : 2;
            unsigned char TPU0MD : 2;
        }
        BIT;
    }
    ELOPF;
    char wk10[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMTW0MD : 2;
        }
        BIT;
    }
    ELOPH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char GPT1MD : 3;
            unsigned char : 1;
            unsigned char GPT0MD : 3;
        }
        BIT;
    }
    ELOPI;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char GPT3MD : 3;
            unsigned char : 1;
            unsigned char GPT2MD : 3;
        }
        BIT;
    }
    ELOPJ;
};

struct st_eptpc
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RESET : 1;
        }
        BIT;
    }
    PTRSTR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long SCLKSEL : 3;
            unsigned long : 5;
            unsigned long SCLKDIV : 3;
        }
        BIT;
    }
    STCSELR;
    char wk0[ 15096 ];
/*	union { */
/*	unsigned long LONG; */
/*		struct { */
/*			unsigned long :10; */
/*			unsigned long CYC5:1; */
/*			unsigned long CYC4:1; */
/*			unsigned long CYC3:1; */
/*			unsigned long CYC2:1; */
/*			unsigned long CYC1:1; */
/*			unsigned long CYC0:1; */
/*			unsigned long :12; */
/*			unsigned long PRC:1; */
/*			unsigned long SY1:1; */
/*			unsigned long SY0:1; */
/*			unsigned long ST:1; */
/*		} BIT; */
/*	} MIESR; */
    unsigned long MIESR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 10;
            unsigned long CYC5 : 1;
            unsigned long CYC4 : 1;
            unsigned long CYC3 : 1;
            unsigned long CYC2 : 1;
            unsigned long CYC1 : 1;
            unsigned long CYC0 : 1;
            unsigned long : 12;
            unsigned long PR : 1;
            unsigned long SY1 : 1;
            unsigned long SY0 : 1;
            unsigned long ST : 1;
        }
        BIT;
    }
    MIEIPR;
    char wk1[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 7;
            unsigned long PLSN : 1;
            unsigned long : 7;
            unsigned long PLSP : 1;
            unsigned long : 2;
            unsigned long CYCN5 : 1;
            unsigned long CYCN4 : 1;
            unsigned long CYCN3 : 1;
            unsigned long CYCN2 : 1;
            unsigned long CYCN1 : 1;
            unsigned long CYCN0 : 1;
            unsigned long : 2;
            unsigned long CYCP5 : 1;
            unsigned long CYCP4 : 1;
            unsigned long CYCP3 : 1;
            unsigned long CYCP2 : 1;
            unsigned long CYCP1 : 1;
            unsigned long CYCP0 : 1;
        }
        BIT;
    }
    ELIPPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 7;
            unsigned long PLSN : 1;
            unsigned long : 7;
            unsigned long PLSP : 1;
            unsigned long : 2;
            unsigned long CYCN5 : 1;
            unsigned long CYCN4 : 1;
            unsigned long CYCN3 : 1;
            unsigned long CYCN2 : 1;
            unsigned long CYCN1 : 1;
            unsigned long CYCN0 : 1;
            unsigned long : 2;
            unsigned long CYCP5 : 1;
            unsigned long CYCP4 : 1;
            unsigned long CYCP3 : 1;
            unsigned long CYCP2 : 1;
            unsigned long CYCP1 : 1;
            unsigned long CYCP0 : 1;
        }
        BIT;
    }
    ELIPACR;
    char wk2[ 40 ];
/*	union { */
/*		unsigned long LONG; */
/*		struct { */
/*			unsigned long :27; */
/*			unsigned long W10D:1; */
/*			unsigned long SYNTOUT:1; */
/*			unsigned long :1; */
/*			unsigned long SYNCOUT:1; */
/*			unsigned long SYNC:1; */
/*		} BIT; */
/*	} STSR; */
    unsigned long STSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long W10D : 1;
            unsigned long SYNTOUT : 1;
            unsigned long : 1;
            unsigned long SYNCOUT : 1;
            unsigned long SYNC : 1;
        }
        BIT;
    }
    STIPR;
    char wk3[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long STCF : 2;
        }
        BIT;
    }
    STCFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long ALEN1 : 1;
            unsigned long ALEN0 : 1;
            unsigned long : 4;
            unsigned long DVTH : 4;
            unsigned long SYTH : 4;
            unsigned long W10S : 1;
            unsigned long : 1;
            unsigned long CMOD : 1;
            unsigned long : 5;
            unsigned long WINT : 8;
        }
        BIT;
    }
    STMR;
    unsigned long SYNTOR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long IPTSEL5 : 1;
            unsigned long IPTSEL4 : 1;
            unsigned long IPTSEL3 : 1;
            unsigned long IPTSEL2 : 1;
            unsigned long IPTSEL1 : 1;
            unsigned long IPTSEL0 : 1;
        }
        BIT;
    }
    IPTSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long MINTEN5 : 1;
            unsigned long MINTEN4 : 1;
            unsigned long MINTEN3 : 1;
            unsigned long MINTEN2 : 1;
            unsigned long MINTEN1 : 1;
            unsigned long MINTEN0 : 1;
        }
        BIT;
    }
    MITSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long ELTDIS5 : 1;
            unsigned long ELTDIS4 : 1;
            unsigned long ELTDIS3 : 1;
            unsigned long ELTDIS2 : 1;
            unsigned long ELTDIS1 : 1;
            unsigned long ELTDIS0 : 1;
        }
        BIT;
    }
    ELTSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long SYSEL : 1;
        }
        BIT;
    }
    STCHSELR;
    char wk5[ 16 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long STR : 1;
        }
        BIT;
    }
    SYNSTARTR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long LOAD : 1;
        }
        BIT;
    }
    LCIVLDR;
    char wk6[ 8 ];
    unsigned long SYNTDARU;
    unsigned long SYNTDARL;
    unsigned long SYNTDBRU;
    unsigned long SYNTDBRL;
    char wk7[ 16 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long VALU : 16;
        }
        BIT;
    }
    LCIVRU;
    unsigned long LCIVRM;
    unsigned long LCIVRL;
    char wk8[ 104 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long GW10 : 1;
        }
        BIT;
    }
    GETW10R;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long LMTU : 31;
        }
        BIT;
    }
    PLIMITRU;
    unsigned long PLIMITRM;
    unsigned long PLIMITRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long LMTU : 31;
        }
        BIT;
    }
    MLIMITRU;
    unsigned long MLIMITRM;
    unsigned long MLIMITRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long INFO : 1;
        }
        BIT;
    }
    GETINFOR;
    char wk9[ 44 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long CNTU : 16;
        }
        BIT;
    }
    LCCVRU;
    unsigned long LCCVRM;
    unsigned long LCCVRL;
    char wk10[ 148 ];
    unsigned long PW10VRU;
    unsigned long PW10VRM;
    unsigned long PW10VRL;
    char wk11[ 180 ];
    unsigned long MW10RU;
    unsigned long MW10RM;
    unsigned long MW10RL;
    char wk12[ 36 ];
    unsigned long TMSTTRU0;
    unsigned long TMSTTRL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        }
        BIT;
    }
    TMCYCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        }
        BIT;
    }
    TMPLSR0;
    unsigned long TMSTTRU1;
    unsigned long TMSTTRL1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        }
        BIT;
    }
    TMCYCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        }
        BIT;
    }
    TMPLSR1;
    unsigned long TMSTTRU2;
    unsigned long TMSTTRL2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        }
        BIT;
    }
    TMCYCR2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        }
        BIT;
    }
    TMPLSR2;
    unsigned long TMSTTRU3;
    unsigned long TMSTTRL3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        }
        BIT;
    }
    TMCYCR3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        }
        BIT;
    }
    TMPLSR3;
    unsigned long TMSTTRU4;
    unsigned long TMSTTRL4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        }
        BIT;
    }
    TMCYCR4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        }
        BIT;
    }
    TMPLSR4;
    unsigned long TMSTTRU5;
    unsigned long TMSTTRL5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        }
        BIT;
    }
    TMCYCR5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        }
        BIT;
    }
    TMPLSR5;
    char wk13[ 28 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long EN5 : 1;
            unsigned long EN4 : 1;
            unsigned long EN3 : 1;
            unsigned long EN2 : 1;
            unsigned long EN1 : 1;
            unsigned long EN0 : 1;
        }
        BIT;
    }
    TMSTARTR;
    char wk14[ 128 ];
/*	union { */
/*		unsigned long LONG; */
/*		struct { */
/*			unsigned long :2; */
/*			unsigned long URE1:1; */
/*			unsigned long URE0:1; */
/*			unsigned long :19; */
/*			unsigned long MACE:1; */
/*			unsigned long :4; */
/*			unsigned long OVRE3:1; */
/*			unsigned long OVRE2:1; */
/*			unsigned long OVRE1:1; */
/*			unsigned long OVRE0:1; */
/*		} BIT; */
/*	} PRSR; */
    unsigned long PRSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long URE1 : 1;
            unsigned long URE0 : 1;
            unsigned long : 19;
            unsigned long MACE : 1;
            unsigned long : 4;
            unsigned long OVRE3 : 1;
            unsigned long OVRE2 : 1;
            unsigned long OVRE1 : 1;
            unsigned long OVRE0 : 1;
        }
        BIT;
    }
    PRIPR;
    char wk15[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    PRMACRU0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    PRMACRL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    PRMACRU1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    PRMACRL1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long TDIS : 2;
        }
        BIT;
    }
    TRNDISR;
    char wk16[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long FWD1 : 1;
            unsigned long FWD0 : 1;
            unsigned long : 7;
            unsigned long MOD : 1;
        }
        BIT;
    }
    TRNMR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long THVAL : 11;
        }
        BIT;
    }
    TRNCTTDR;
};

