FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_eptpc0
{
/*	union { */
/*		unsigned long LONG; */
/*		struct { */
/*			unsigned long :14; */
/*			unsigned long GENDN:1; */
/*			unsigned long RESDN:1; */
/*			unsigned long :1; */
/*			unsigned long INFABT:1; */
/*			unsigned long :1; */
/*			unsigned long RECLP:1; */
/*			unsigned long :5; */
/*			unsigned long DRQOVR:1; */
/*			unsigned long INTDEV:1; */
/*			unsigned long DRPTO:1; */
/*			unsigned long :1; */
/*			unsigned long MPDUD:1; */
/*			unsigned long INTCHG:1; */
/*			unsigned long OFMUD:1; */
/*		} BIT; */
/*	} SYSR; */
    unsigned long SYSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long GENDN : 1;
            unsigned long RESDN : 1;
            unsigned long : 1;
            unsigned long INFABT : 1;
            unsigned long : 1;
            unsigned long RECLP : 1;
            unsigned long : 5;
            unsigned long DRQOVR : 1;
            unsigned long INTDEV : 1;
            unsigned long DRPTO : 1;
            unsigned long : 1;
            unsigned long MPDUD : 1;
            unsigned long INTCHG : 1;
            unsigned long OFMUD : 1;
        }
        BIT;
    }
    SYIPR;
    char wk0[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    SYMACRU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    SYMACRL;
    unsigned long SYLLCCTLR;
    unsigned long SYIPADDRR;
    char wk1[ 32 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long TRSP : 4;
            unsigned long VER : 4;
        }
        BIT;
    }
    SYSPVRR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long DNUM : 8;
        }
        BIT;
    }
    SYDOMR;
    char wk2[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long FLAG15 : 1;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long FLAG12 : 1;
            unsigned long FLAG11 : 1;
            unsigned long FLAG10 : 1;
            unsigned long FLAG9 : 1;
            unsigned long FLAG8 : 1;
            unsigned long FLAG7 : 1;
            unsigned long FLAG6 : 1;
            unsigned long FLAG5 : 1;
            unsigned long FLAG4 : 1;
            unsigned long FLAG3 : 1;
            unsigned long FLAG2 : 1;
            unsigned long FLAG1 : 1;
            unsigned long FLAG0 : 1;
        }
        BIT;
    }
    ANFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long FLAG15 : 1;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long FLAG12 : 1;
            unsigned long FLAG11 : 1;
            unsigned long FLAG10 : 1;
            unsigned long FLAG9 : 1;
            unsigned long FLAG8 : 1;
            unsigned long FLAG7 : 1;
            unsigned long FLAG6 : 1;
            unsigned long FLAG5 : 1;
            unsigned long FLAG4 : 1;
            unsigned long FLAG3 : 1;
            unsigned long FLAG2 : 1;
            unsigned long FLAG1 : 1;
            unsigned long FLAG0 : 1;
        }
        BIT;
    }
    SYNFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long FLAG15 : 1;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long FLAG12 : 1;
            unsigned long FLAG11 : 1;
            unsigned long FLAG10 : 1;
            unsigned long FLAG9 : 1;
            unsigned long FLAG8 : 1;
            unsigned long FLAG7 : 1;
            unsigned long FLAG6 : 1;
            unsigned long FLAG5 : 1;
            unsigned long FLAG4 : 1;
            unsigned long FLAG3 : 1;
            unsigned long FLAG2 : 1;
            unsigned long FLAG1 : 1;
            unsigned long FLAG0 : 1;
        }
        BIT;
    }
    DYRQFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long FLAG15 : 1;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long FLAG12 : 1;
            unsigned long FLAG11 : 1;
            unsigned long FLAG10 : 1;
            unsigned long FLAG9 : 1;
            unsigned long FLAG8 : 1;
            unsigned long FLAG7 : 1;
            unsigned long FLAG6 : 1;
            unsigned long FLAG5 : 1;
            unsigned long FLAG4 : 1;
            unsigned long FLAG3 : 1;
            unsigned long FLAG2 : 1;
            unsigned long FLAG1 : 1;
            unsigned long FLAG0 : 1;
        }
        BIT;
    }
    DYRPFR;
    unsigned long SYCIDRU;
    unsigned long SYCIDRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long PNUM : 16;
        }
        BIT;
    }
    SYPNUMR;
    char wk3[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long ANUP : 1;
            unsigned long STUP : 1;
            unsigned long BMUP : 1;
        }
        BIT;
    }
    SYRVLDR;
    char wk4[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long PDFUP : 3;
            unsigned long : 1;
            unsigned long PDRP : 3;
            unsigned long : 1;
            unsigned long PDRQ : 3;
            unsigned long : 1;
            unsigned long DRP : 3;
            unsigned long : 1;
            unsigned long DRQ : 3;
            unsigned long : 1;
            unsigned long FUP : 3;
            unsigned long : 1;
            unsigned long SYNC : 3;
            unsigned long : 2;
            unsigned long ANCE : 2;
        }
        BIT;
    }
    SYRFL1R;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long ILL : 2;
            unsigned long : 22;
            unsigned long SIG : 2;
            unsigned long : 2;
            unsigned long MAN : 2;
        }
        BIT;
    }
    SYRFL2R;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long PDRQ : 1;
            unsigned long : 3;
            unsigned long DRQ : 1;
            unsigned long : 3;
            unsigned long SYNC : 1;
            unsigned long : 3;
            unsigned long ANCE : 1;
        }
        BIT;
    }
    SYTRENR;
    char wk5[ 4 ];
    unsigned long MTCIDU;
    unsigned long MTCIDL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long PNUM : 16;
        }
        BIT;
    }
    MTPID;
    char wk6[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long DREQ : 8;
            unsigned long SYNC : 8;
            unsigned long ANCE : 8;
        }
        BIT;
    }
    SYTLIR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long DRESP : 8;
            unsigned long SYNC : 8;
            unsigned long ANCE : 8;
        }
        BIT;
    }
    SYRLIR;
    unsigned long OFMRU;
    unsigned long OFMRL;
    unsigned long MPDRU;
    unsigned long MPDRL;
    char wk7[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long GMPR1 : 8;
            unsigned long : 8;
            unsigned long GMPR2 : 8;
        }
        BIT;
    }
    GMPR;
    unsigned long GMCQR;
    unsigned long GMIDRU;
    unsigned long GMIDRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CUTO : 16;
            unsigned long : 8;
            unsigned long TSRC : 8;
        }
        BIT;
    }
    CUOTSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long SRMV : 16;
        }
        BIT;
    }
    SRR;
    char wk8[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    PPMACRU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    PPMACRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    PDMACRU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    PDMACRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long TYPE : 16;
        }
        BIT;
    }
    PETYPER;
    char wk9[ 12 ];
    unsigned long PPIPR;
    unsigned long PDIPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long EVTO : 8;
        }
        BIT;
    }
    PETOSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long GETO : 8;
        }
        BIT;
    }
    PGTOSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long PRTL : 8;
        }
        BIT;
    }
    PPTTLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long PDTL : 8;
        }
        BIT;
    }
    PDTTLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long EVUPT : 16;
        }
        BIT;
    }
    PEUDPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long GEUPT : 16;
        }
        BIT;
    }
    PGUDPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 15;
            unsigned long EXTPRM : 1;
            unsigned long : 13;
            unsigned long ENB : 1;
            unsigned long PRT : 1;
            unsigned long SEL : 1;
        }
        BIT;
    }
    FFLTR;
    char wk10[ 28 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    FMAC0RU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    FMAC0RL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        }
        BIT;
    }
    FMAC1RU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        }
        BIT;
    }
    FMAC1RL;
    char wk11[ 80 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long ASYMU : 16;
        }
        BIT;
    }
    DASYMRU;
    unsigned long DASYMRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long INGP : 16;
            unsigned long EGP : 16;
        }
        BIT;
    }
    TSLATR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 11;
            unsigned long TCMOD : 1;
            unsigned long : 3;
            unsigned long FILDIS : 1;
            unsigned long : 3;
            unsigned long SBDIS : 1;
            unsigned long : 4;
            unsigned long TCYC : 8;
        }
        BIT;
    }
    SYCONFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long FORM1 : 1;
            unsigned long FORM0 : 1;
        }
        BIT;
    }
    SYFORMR;
    unsigned long RSTOUTR;
};

