FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_flash
{
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char FLWE : 2;
        }
        BIT;
    }
    FWEPROR;
    char wk1[ 7806329 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CFAE : 1;
            unsigned char : 2;
            unsigned char CMDLK : 1;
            unsigned char DFAE : 1;
            unsigned char : 2;
            unsigned char ECRCT : 1;
        }
        BIT;
    }
    FASTAT;
    char wk2[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CFAEIE : 1;
            unsigned char : 2;
            unsigned char CMDLKIE : 1;
            unsigned char DFAEIE : 1;
            unsigned char : 2;
            unsigned char ECRCTIE : 1;
        }
        BIT;
    }
    FAEINT;
    char wk3[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char FRDYIE : 1;
        }
        BIT;
    }
    FRDYIE;
    char wk4[ 23 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long FSADDR : 32;
        }
        BIT;
    }
    FSADDR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long FEADDR : 32;
        }
        BIT;
    }
    FEADDR;
    char wk5[ 28 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short : 6;
            unsigned short FRAMTRAN : 1;
            unsigned short FCRME : 1;
        }
        BIT;
    }
    FCURAME;
    char wk6[ 42 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long FRDY : 1;
            unsigned long ILGLERR : 1;
            unsigned long ERSERR : 1;
            unsigned long PRGERR : 1;
            unsigned long SUSRDY : 1;
            unsigned long DBFULL : 1;
            unsigned long ERSSPD : 1;
            unsigned long PRGSPD : 1;
            unsigned long FCUERR : 1;
            unsigned long FLWEERR : 1;
            unsigned long : 4;
            unsigned long FRDTCT : 1;
            unsigned long FRCRCT : 1;
        }
        BIT;
    }
    FSTATR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short FENTRYD : 1;
            unsigned short : 6;
            unsigned short FENTRYC : 1;
        }
        BIT;
    }
    FENTRYR;
    char wk7[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short : 7;
            unsigned short FPROTCN : 1;
        }
        BIT;
    }
    FPROTR;
    char wk8[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short : 7;
            unsigned short SUINIT : 1;
        }
        BIT;
    }
    FSUINITR;
    char wk9[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char FLOCKST : 1;
        }
        BIT;
    }
    FLKSTAT;
    char wk10[ 15 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMDR : 8;
            unsigned short PCMDR : 8;
        }
        BIT;
    }
    FCMDR;
    char wk11[ 30 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short PEERRST : 8;
        }
        BIT;
    }
    FPESTAT;
    char wk12[ 14 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char BCDIR : 1;
        }
        BIT;
    }
    FBCCNT;
    char wk13[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char BCST : 1;
        }
        BIT;
    }
    FBCSTAT;
    char wk14[ 3 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long PSADR : 19;
        }
        BIT;
    }
    FPSADDR;
    char wk15[ 4 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short ESUSPMD : 1;
        }
        BIT;
    }
    FCPSR;
    char wk16[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short PCKA : 8;
        }
        BIT;
    }
    FPCKAR;
};

struct st_gpt
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 12;
            unsigned short CST3 : 1;
            unsigned short CST2 : 1;
            unsigned short CST1 : 1;
            unsigned short CST0 : 1;
        }
        BIT;
    }
    GTSTR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short NFCS3 : 2;
            unsigned short NFCS2 : 2;
            unsigned short NFCS1 : 2;
            unsigned short NFCS0 : 2;
            unsigned short NFB3EN : 1;
            unsigned short NFA3EN : 1;
            unsigned short NFB2EN : 1;
            unsigned short NFA2EN : 1;
            unsigned short NFB1EN : 1;
            unsigned short NFA1EN : 1;
            unsigned short NFB0EN : 1;
            unsigned short NFA0EN : 1;
        }
        BIT;
    }
    NFCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CPHW3 : 2;
            unsigned short CPHW2 : 2;
            unsigned short CPHW1 : 2;
            unsigned short CPHW0 : 2;
            unsigned short CSHW3 : 2;
            unsigned short CSHW2 : 2;
            unsigned short CSHW1 : 2;
            unsigned short CSHW0 : 2;
        }
        BIT;
    }
    GTHSCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short CCSW3 : 1;
            unsigned short CCSW2 : 1;
            unsigned short CCSW1 : 1;
            unsigned short CCSW0 : 1;
            unsigned short CCHW3 : 2;
            unsigned short CCHW2 : 2;
            unsigned short CCHW1 : 2;
            unsigned short CCHW0 : 2;
        }
        BIT;
    }
    GTHCCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CSHSL3 : 4;
            unsigned short CSHSL2 : 4;
            unsigned short CSHSL1 : 4;
            unsigned short CSHSL0 : 4;
        }
        BIT;
    }
    GTHSSR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CSHPL3 : 4;
            unsigned short CSHPL2 : 4;
            unsigned short CSHPL1 : 4;
            unsigned short CSHPL0 : 4;
        }
        BIT;
    }
    GTHPSR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 12;
            unsigned short WP3 : 1;
            unsigned short WP2 : 1;
            unsigned short WP1 : 1;
            unsigned short WP0 : 1;
        }
        BIT;
    }
    GTWP;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short SYNC3 : 2;
            unsigned short : 2;
            unsigned short SYNC2 : 2;
            unsigned short : 2;
            unsigned short SYNC1 : 2;
            unsigned short : 2;
            unsigned short SYNC0 : 2;
        }
        BIT;
    }
    GTSYNC;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short GTETRGEN : 1;
            unsigned short GTENFCS : 2;
            unsigned short : 11;
            unsigned short ETINEN : 1;
            unsigned short ETIPEN : 1;
        }
        BIT;
    }
    GTETINT;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BD33 : 1;
            unsigned short BD32 : 1;
            unsigned short BD31 : 1;
            unsigned short BD30 : 1;
            unsigned short BD23 : 1;
            unsigned short BD22 : 1;
            unsigned short BD21 : 1;
            unsigned short BD20 : 1;
            unsigned short BD13 : 1;
            unsigned short BD12 : 1;
            unsigned short BD11 : 1;
            unsigned short BD10 : 1;
            unsigned short BD03 : 1;
            unsigned short BD02 : 1;
            unsigned short BD01 : 1;
            unsigned short BD00 : 1;
        }
        BIT;
    }
    GTBDR;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 12;
            unsigned short SWP3 : 1;
            unsigned short SWP2 : 1;
            unsigned short SWP1 : 1;
            unsigned short SWP0 : 1;
        }
        BIT;
    }
    GTSWP;
};

struct st_gpt0
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OBHLD : 1;
            unsigned short OBDFLT : 1;
            unsigned short GTIOB : 6;
            unsigned short OAHLD : 1;
            unsigned short OADFLT : 1;
            unsigned short GTIOA : 6;
        }
        BIT;
    }
    GTIOR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADTRBDEN : 1;
            unsigned short ADTRBUEN : 1;
            unsigned short ADTRADEN : 1;
            unsigned short ADTRAUEN : 1;
            unsigned short EINT : 1;
            unsigned short : 3;
            unsigned short GTINTPR : 2;
            unsigned short GTINTF : 1;
            unsigned short GTINTE : 1;
            unsigned short GTINTD : 1;
            unsigned short GTINTC : 1;
            unsigned short GTINTB : 1;
            unsigned short GTINTA : 1;
        }
        BIT;
    }
    GTINTAD;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short CCLR : 2;
            unsigned short : 2;
            unsigned short TPCS : 2;
            unsigned short : 5;
            unsigned short MD : 3;
        }
        BIT;
    }
    GTCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 1;
            unsigned short ADTDB : 1;
            unsigned short ADTTB : 2;
            unsigned short : 1;
            unsigned short ADTDA : 1;
            unsigned short ADTTA : 2;
            unsigned short : 1;
            unsigned short CCRSWT : 1;
            unsigned short PR : 2;
            unsigned short CCRB : 2;
            unsigned short CCRA : 2;
        }
        BIT;
    }
    GTBER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 14;
            unsigned short UDF : 1;
            unsigned short UD : 1;
        }
        BIT;
    }
    GTUDC;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 1;
            unsigned short ADTBL : 1;
            unsigned short : 1;
            unsigned short ADTAL : 1;
            unsigned short : 1;
            unsigned short IVTT : 3;
            unsigned short IVTC : 2;
            unsigned short ITLF : 1;
            unsigned short ITLE : 1;
            unsigned short ITLD : 1;
            unsigned short ITLC : 1;
            unsigned short ITLB : 1;
            unsigned short ITLA : 1;
        }
        BIT;
    }
    GTITC;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short TUCF : 1;
            unsigned short : 3;
            unsigned short DTEF : 1;
            unsigned short ITCNT : 3;
        }
        BIT;
    }
    GTST;
    unsigned short GTCNT;
    unsigned short GTCCRA;
    unsigned short GTCCRB;
    unsigned short GTCCRC;
    unsigned short GTCCRD;
    unsigned short GTCCRE;
    unsigned short GTCCRF;
    unsigned short GTPR;
    unsigned short GTPBR;
    unsigned short GTPDBR;
    char wk0[ 2 ];
    unsigned short GTADTRA;
    unsigned short GTADTBRA;
    unsigned short GTADTDBRA;
    char wk1[ 2 ];
    unsigned short GTADTRB;
    unsigned short GTADTBRB;
    unsigned short GTADTDBRB;
    char wk2[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OBE : 1;
            unsigned short OAE : 1;
            unsigned short : 1;
            unsigned short SWN : 1;
            unsigned short : 3;
            unsigned short NFV : 1;
            unsigned short NFS : 4;
            unsigned short NVB : 1;
            unsigned short NVA : 1;
            unsigned short NEB : 1;
            unsigned short NEA : 1;
        }
        BIT;
    }
    GTONCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 7;
            unsigned short TDFER : 1;
            unsigned short : 2;
            unsigned short TDBDE : 1;
            unsigned short TDBUE : 1;
            unsigned short : 3;
            unsigned short TDE : 1;
        }
        BIT;
    }
    GTDTCR;
    unsigned short GTDVU;
    unsigned short GTDVD;
    unsigned short GTDBU;
    unsigned short GTDBD;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 14;
            unsigned short SOS : 2;
        }
        BIT;
    }
    GTSOS;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short SOTR : 1;
        }
        BIT;
    }
    GTSOTR;
};

