FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
        BIT;
    }
    SLIBR166;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR167;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR168;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR169;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR170;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR171;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR172;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR173;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR174;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR175;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR176;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR177;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR178;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR179;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR180;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR181;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR182;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR183;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR184;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR185;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR186;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR187;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR188;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR189;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR190;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR191;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR192;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR193;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR194;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR195;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR196;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR197;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR198;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR199;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR200;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR201;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR202;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR203;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR204;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR205;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR206;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIBR207;
    char wk23[ 96 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long IS31 : 1;
            unsigned long IS30 : 1;
            unsigned long IS29 : 1;
            unsigned long IS28 : 1;
            unsigned long IS27 : 1;
            unsigned long IS26 : 1;
            unsigned long IS25 : 1;
            unsigned long IS24 : 1;
            unsigned long IS23 : 1;
            unsigned long IS22 : 1;
            unsigned long IS21 : 1;
            unsigned long IS20 : 1;
            unsigned long IS19 : 1;
            unsigned long IS18 : 1;
            unsigned long IS17 : 1;
            unsigned long IS16 : 1;
            unsigned long IS15 : 1;
            unsigned long IS14 : 1;
            unsigned long IS13 : 1;
            unsigned long IS12 : 1;
            unsigned long IS11 : 1;
            unsigned long IS10 : 1;
            unsigned long IS9 : 1;
            unsigned long IS8 : 1;
            unsigned long IS7 : 1;
            unsigned long IS6 : 1;
            unsigned long IS5 : 1;
            unsigned long IS4 : 1;
            unsigned long IS3 : 1;
            unsigned long IS2 : 1;
            unsigned long IS1 : 1;
            unsigned long IS0 : 1;
        }
        BIT;
    }
    GRPAL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long IS31 : 1;
            unsigned long IS30 : 1;
            unsigned long IS29 : 1;
            unsigned long IS28 : 1;
            unsigned long IS27 : 1;
            unsigned long IS26 : 1;
            unsigned long IS25 : 1;
            unsigned long IS24 : 1;
            unsigned long IS23 : 1;
            unsigned long IS22 : 1;
            unsigned long IS21 : 1;
            unsigned long IS20 : 1;
            unsigned long IS19 : 1;
            unsigned long IS18 : 1;
            unsigned long IS17 : 1;
            unsigned long IS16 : 1;
            unsigned long IS15 : 1;
            unsigned long IS14 : 1;
            unsigned long IS13 : 1;
            unsigned long IS12 : 1;
            unsigned long IS11 : 1;
            unsigned long IS10 : 1;
            unsigned long IS9 : 1;
            unsigned long IS8 : 1;
            unsigned long IS7 : 1;
            unsigned long IS6 : 1;
            unsigned long IS5 : 1;
            unsigned long IS4 : 1;
            unsigned long IS3 : 1;
            unsigned long IS2 : 1;
            unsigned long IS1 : 1;
            unsigned long IS0 : 1;
        }
        BIT;
    }
    GRPAL1;
    char wk24[ 56 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long EN31 : 1;
            unsigned long EN30 : 1;
            unsigned long EN29 : 1;
            unsigned long EN28 : 1;
            unsigned long EN27 : 1;
            unsigned long EN26 : 1;
            unsigned long EN25 : 1;
            unsigned long EN24 : 1;
            unsigned long EN23 : 1;
            unsigned long EN22 : 1;
            unsigned long EN21 : 1;
            unsigned long EN20 : 1;
            unsigned long EN19 : 1;
            unsigned long EN18 : 1;
            unsigned long EN17 : 1;
            unsigned long EN16 : 1;
            unsigned long EN15 : 1;
            unsigned long EN14 : 1;
            unsigned long EN13 : 1;
            unsigned long EN12 : 1;
            unsigned long EN11 : 1;
            unsigned long EN10 : 1;
            unsigned long EN9 : 1;
            unsigned long EN8 : 1;
            unsigned long EN7 : 1;
            unsigned long EN6 : 1;
            unsigned long EN5 : 1;
            unsigned long EN4 : 1;
            unsigned long EN3 : 1;
            unsigned long EN2 : 1;
            unsigned long EN1 : 1;
            unsigned long EN0 : 1;
        }
        BIT;
    }
    GENAL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long EN31 : 1;
            unsigned long EN30 : 1;
            unsigned long EN29 : 1;
            unsigned long EN28 : 1;
            unsigned long EN27 : 1;
            unsigned long EN26 : 1;
            unsigned long EN25 : 1;
            unsigned long EN24 : 1;
            unsigned long EN23 : 1;
            unsigned long EN22 : 1;
            unsigned long EN21 : 1;
            unsigned long EN20 : 1;
            unsigned long EN19 : 1;
            unsigned long EN18 : 1;
            unsigned long EN17 : 1;
            unsigned long EN16 : 1;
            unsigned long EN15 : 1;
            unsigned long EN14 : 1;
            unsigned long EN13 : 1;
            unsigned long EN12 : 1;
            unsigned long EN11 : 1;
            unsigned long EN10 : 1;
            unsigned long EN9 : 1;
            unsigned long EN8 : 1;
            unsigned long EN7 : 1;
            unsigned long EN6 : 1;
            unsigned long EN5 : 1;
            unsigned long EN4 : 1;
            unsigned long EN3 : 1;
            unsigned long EN2 : 1;
            unsigned long EN1 : 1;
            unsigned long EN0 : 1;
        }
        BIT;
    }
    GENAL1;
    char wk25[ 136 ];
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR0;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR1;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR2;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR3;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR4;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR5;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR6;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR7;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR8;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIAR9;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIARA;
    union
    {
        unsigned char BYTE;
/*		struct { */
/*			unsigned char PIR7:1; */
/*			unsigned char PIR6:1; */
/*			unsigned char PIR5:1; */
/*			unsigned char PIR4:1; */
/*			unsigned char PIR3:1; */
/*			unsigned char PIR2:1; */
/*			unsigned char PIR1:1; */
/*			unsigned char PIR0:1; */
/*		} BIT; */
    }
    PIARB;
    char wk26[ 196 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR208;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR209;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR210;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR211;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR212;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR213;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR214;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR215;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR216;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR217;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR218;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR219;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR220;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR221;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR222;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR223;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR224;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR225;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR226;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR227;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR228;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR229;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR230;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR231;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR232;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR233;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR234;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR235;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR236;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR237;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR238;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR239;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR240;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR241;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR242;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR243;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR244;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR245;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR246;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR247;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR248;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR249;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR250;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR251;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR252;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR253;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR254;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        }
        BIT;
    }
    SLIAR255;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char WPRC : 1;
        }
        BIT;
    }
    SLIPRCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char SELEXD1 : 1;
            unsigned char SELEXD0 : 1;
        }
        BIT;
    }
    SELEXDR;
};

