FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_mpc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS7E : 1;
            unsigned char CS6E : 1;
            unsigned char CS5E : 1;
            unsigned char CS4E : 1;
            unsigned char CS3E : 1;
            unsigned char CS2E : 1;
            unsigned char CS1E : 1;
            unsigned char CS0E : 1;
        }
        BIT;
    }
    PFCSE;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS3S : 2;
            unsigned char CS2S : 2;
            unsigned char CS1S : 2;
            unsigned char : 1;
            unsigned char CS0S : 1;
        }
        BIT;
    }
    PFCSS0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS7S : 2;
            unsigned char CS6S : 2;
            unsigned char CS5S : 2;
            unsigned char CS4S : 2;
        }
        BIT;
    }
    PFCSS1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char A15E : 1;
            unsigned char A14E : 1;
            unsigned char A13E : 1;
            unsigned char A12E : 1;
            unsigned char A11E : 1;
            unsigned char A10E : 1;
            unsigned char A9E : 1;
            unsigned char A8E : 1;
        }
        BIT;
    }
    PFAOE0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char A23E : 1;
            unsigned char A22E : 1;
            unsigned char A21E : 1;
            unsigned char A20E : 1;
            unsigned char A19E : 1;
            unsigned char A18E : 1;
            unsigned char A17E : 1;
            unsigned char A16E : 1;
        }
        BIT;
    }
    PFAOE1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char WR32BC32E : 1;
            unsigned char WR1BC1E : 1;
            unsigned char DH32E : 1;
            unsigned char DHE : 1;
            unsigned char BCLKO : 1;
            unsigned char ADRHMS2 : 1;
            unsigned char ADRHMS : 1;
            unsigned char ADRLE : 1;
        }
        BIT;
    }
    PFBCR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SDCLKE : 1;
            unsigned char DQM1E : 1;
            unsigned char : 1;
            unsigned char MDSDE : 1;
            unsigned char ALES : 1;
            unsigned char ALEOE : 1;
            unsigned char WAITS : 2;
        }
        BIT;
    }
    PFBCR1;
    char wk1[ 6 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PHYMODE1 : 1;
            unsigned char PHYMODE0 : 1;
        }
        BIT;
    }
    PFENET;
    char wk2[ 16 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B0WI : 1;
            unsigned char PFSWE : 1;
        }
        BIT;
    }
    PWPR;
    char wk3[ 32 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P00PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P01PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P02PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P03PFS;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P05PFS;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P07PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P10PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P11PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P12PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P13PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P14PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P15PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P16PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P17PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P20PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P21PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P22PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P23PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P24PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P25PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P26PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P27PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P30PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P31PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P32PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P33PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P34PFS;
    char wk6[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P40PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P41PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P42PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P43PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P44PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P45PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P46PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
        }
        BIT;
    }
    P47PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P50PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P51PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P52PFS;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P54PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P55PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P56PFS;
    char wk8[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P60PFS;
    char wk9[ 5 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P66PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P67PFS;
    char wk10[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P71PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P72PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P73PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P74PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P75PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P76PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P77PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P80PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P81PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P82PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P83PFS;
    char wk11[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P86PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P87PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P90PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P91PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P92PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P93PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P94PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P95PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P96PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    P97PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PA7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PB7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PC7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PD7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PE7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        }
        BIT;
    }
    PF0PFS;
    union
