FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_mtu5
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char : 1;
            unsigned char NFWEN : 1;
            unsigned char NFVEN : 1;
            unsigned char NFUEN : 1;
        }
        BIT;
    }
    NFCR5;
    char wk1[ 490 ];
    unsigned short TCNTU;
    unsigned short TGRU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        }
        BIT;
    }
    TCRU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC2 : 3;
        }
        BIT;
    }
    TCR2U;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        }
        BIT;
    }
    TIORU;
    char wk2[ 9 ];
    unsigned short TCNTV;
    unsigned short TGRV;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        }
        BIT;
    }
    TCRV;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC2 : 3;
        }
        BIT;
    }
    TCR2V;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        }
        BIT;
    }
    TIORV;
    char wk3[ 9 ];
    unsigned short TCNTW;
    unsigned short TGRW;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        }
        BIT;
    }
    TCRW;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC2 : 3;
        }
        BIT;
    }
    TCR2W;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        }
        BIT;
    }
    TIORW;
    char wk4[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TGIE5U : 1;
            unsigned char TGIE5V : 1;
            unsigned char TGIE5W : 1;
        }
        BIT;
    }
    TIER;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char CSTU5 : 1;
            unsigned char CSTV5 : 1;
            unsigned char CSTW5 : 1;
        }
        BIT;
    }
    TSTR;
    char wk6[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char CMPCLR5U : 1;
            unsigned char CMPCLR5V : 1;
            unsigned char CMPCLR5W : 1;
        }
        BIT;
    }
    TCNTCMPCLR;
};

struct st_mtu6
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR1;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    char wk3[ 7 ];
    unsigned short TCNT;
    char wk4[ 6 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk5[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk6[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
        }
        BIT;
    }
    TSR;
    char wk7[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        }
        BIT;
    }
    TBTM;
    char wk8[ 19 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        }
        BIT;
    }
    TCR2;
    char wk9[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CE0A : 1;
            unsigned char CE0B : 1;
            unsigned char CE0C : 1;
            unsigned char CE0D : 1;
            unsigned char CE1A : 1;
            unsigned char CE1B : 1;
            unsigned char CE2A : 1;
            unsigned char CE2B : 1;
        }
        BIT;
    }
    TSYCR;
    char wk10[ 33 ];
    unsigned short TGRE;
    char wk11[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR6;
};

struct st_mtu7
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR1;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char TTGE2 : 1;
            unsigned char : 1;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    char wk4[ 8 ];
    unsigned short TCNT;
    char wk5[ 8 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk6[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
        }
        BIT;
    }
    TSR;
    char wk8[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        }
        BIT;
    }
    TBTM;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BF : 2;
            unsigned short : 6;
            unsigned short UT7AE : 1;
            unsigned short DT7AE : 1;
            unsigned short UT7BE : 1;
            unsigned short DT7BE : 1;
            unsigned short ITA6AE : 1;
            unsigned short ITA7VE : 1;
            unsigned short ITB6AE : 1;
            unsigned short ITB7VE : 1;
        }
        BIT;
    }
    TADCR;
    char wk10[ 2 ];
    unsigned short TADCORA;
    unsigned short TADCORB;
    unsigned short TADCOBRA;
    unsigned short TADCOBRB;
    char wk11[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        }
        BIT;
    }
    TCR2;
    char wk12[ 38 ];
    unsigned short TGRE;
    unsigned short TGRF;
    char wk13[ 28 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR7;
};

struct st_mtu8
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR8;
    char wk0[ 871 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        }
        BIT;
    }
    TCR2;
    char wk2[ 1 ];
    unsigned long TCNT;
    unsigned long TGRA;
    unsigned long TGRB;
    unsigned long TGRC;
    unsigned long TGRD;
};

struct st_pdc
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long EDS : 1;
            unsigned long PCKDIV : 3;
            unsigned long PCKOE : 1;
            unsigned long HERIE : 1;
            unsigned long VERIE : 1;
            unsigned long UDRIE : 1;
            unsigned long OVIE : 1;
            unsigned long FEIE : 1;
            unsigned long DFIE : 1;
            unsigned long PRST : 1;
            unsigned long HPS : 1;
            unsigned long VPS : 1;
            unsigned long PCKE : 1;
        }
        BIT;
    }
    PCCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long PCE : 1;
        }
        BIT;
    }
    PCCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long HERF : 1;
            unsigned long VERF : 1;
            unsigned long UDRF : 1;
            unsigned long OVRF : 1;
            unsigned long FEF : 1;
            unsigned long FEMPF : 1;
            unsigned long FBSY : 1;
        }
        BIT;
    }
    PCSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long HSYNC : 1;
            unsigned long VSYNC : 1;
        }
        BIT;
    }
    PCMONR;
    union
    {
        unsigned long LONG;
    }
    PCDR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 4;
            unsigned long VSZ : 12;
            unsigned long : 4;
            unsigned long VST : 12;
        }
        BIT;
    }
    VCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 4;
            unsigned long HSZ : 12;
            unsigned long : 4;
            unsigned long HST : 12;
        }
        BIT;
    }
    HCR;
};

struct st_poe
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE0F : 1;
            unsigned short : 3;
            unsigned short PIE1 : 1;
            unsigned short : 6;
            unsigned short POE0M : 2;
        }
        BIT;
    }
    ICSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OSF1 : 1;
            unsigned short : 5;
            unsigned short OCE1 : 1;
            unsigned short OIE1 : 1;
        }
        BIT;
    }
    OCSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE4F : 1;
            unsigned short : 3;
            unsigned short PIE2 : 1;
            unsigned short : 6;
            unsigned short POE4M : 2;
        }
        BIT;
    }
    ICSR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OSF2 : 1;
            unsigned short : 5;
            unsigned short OCE2 : 1;
            unsigned short OIE2 : 1;
        }
        BIT;
    }
    OCSR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE8F : 1;
            unsigned short : 2;
            unsigned short POE8E : 1;
            unsigned short PIE3 : 1;
            unsigned short : 6;
            unsigned short POE8M : 2;
        }
        BIT;
    }
    ICSR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char GPT23HIZ : 1;
            unsigned char GPT01HIZ : 1;
            unsigned char MTUCH0HIZ : 1;
            unsigned char MTUCH67HIZ : 1;
            unsigned char MTUCH34HIZ : 1;
        }
        BIT;
    }
    SPOER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char MTU0DZE : 1;
            unsigned char MTU0CZE : 1;
            unsigned char MTU0BZE : 1;
            unsigned char MTU0AZE : 1;
        }
        BIT;
    }
    POECR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short MTU3BDZE : 1;
            unsigned short MTU4ACZE : 1;
            unsigned short MTU4BDZE : 1;
            unsigned short : 5;
            unsigned short MTU6BDZE : 1;
            unsigned short MTU7ACZE : 1;
            unsigned short MTU7BDZE : 1;
        }
        BIT;
    }
    POECR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 6;
            unsigned short GPT3ABZE : 1;
            unsigned short GPT2ABZE : 1;
            unsigned short : 6;
            unsigned short GPT1ABZE : 1;
            unsigned short GPT0ABZE : 1;
        }
        BIT;
    }
    POECR3;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short IC5ADDMT67ZE : 1;
            unsigned short IC4ADDMT67ZE : 1;
            unsigned short IC3ADDMT67ZE : 1;
            unsigned short : 1;
            unsigned short IC1ADDMT67ZE : 1;
            unsigned short : 3;
            unsigned short IC5ADDMT34ZE : 1;
            unsigned short IC4ADDMT34ZE : 1;
            unsigned short IC3ADDMT34ZE : 1;
            unsigned short IC2ADDMT34ZE : 1;
        }
        BIT;
    }
    POECR4;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 10;
            unsigned short IC5ADDMT0ZE : 1;
            unsigned short IC4ADDMT0ZE : 1;
            unsigned short : 1;
            unsigned short IC2ADDMT0ZE : 1;
            unsigned short IC1ADDMT0ZE : 1;
        }
        BIT;
    }
    POECR5;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short IC4ADDGPT23ZE : 1;
            unsigned short IC3ADDGPT23ZE : 1;
            unsigned short IC2ADDGPT23ZE : 1;
            unsigned short IC1ADDGPT23ZE : 1;
            unsigned short : 3;
            unsigned short IC5ADDGPT01ZE : 1;
            unsigned short : 1;
            unsigned short IC3ADDGPT01ZE : 1;
            unsigned short IC2ADDGPT01ZE : 1;
            unsigned short IC1ADDGPT01ZE : 1;
        }
        BIT;
    }
    POECR6;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE10F : 1;
            unsigned short : 2;
            unsigned short POE10E : 1;
            unsigned short PIE4 : 1;
            unsigned short : 6;
            unsigned short POE10M : 2;
        }
        BIT;
    }
    ICSR4;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE11F : 1;
            unsigned short : 2;
            unsigned short POE11E : 1;
            unsigned short PIE5 : 1;
            unsigned short : 6;
            unsigned short POE11M : 2;
        }
        BIT;
    }
    ICSR5;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short OLSEN : 1;
            unsigned short : 1;
            unsigned short OLSG2B : 1;
            unsigned short OLSG2A : 1;
            unsigned short OLSG1B : 1;
            unsigned short OLSG1A : 1;
            unsigned short OLSG0B : 1;
            unsigned short OLSG0A : 1;
        }
        BIT;
    }
    ALR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short OSTSTF : 1;
            unsigned short : 2;
            unsigned short OSTSTE : 1;
        }
        BIT;
    }
    ICSR6;
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G0BSEL : 4;
            unsigned char G0ASEL : 4;
        }
        BIT;
    }
    G0SELR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G1BSEL : 4;
            unsigned char G1ASEL : 4;
        }
        BIT;
    }
    G1SELR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G2BSEL : 4;
            unsigned char G2ASEL : 4;
        }
        BIT;
    }
    G2SELR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3BSEL : 4;
            unsigned char G3ASEL : 4;
        }
        BIT;
    }
    G3SELR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M0BSEL : 4;
            unsigned char M0ASEL : 4;
        }
        BIT;
    }
    M0SELR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M0DSEL : 4;
            unsigned char M0CSEL : 4;
        }
        BIT;
    }
    M0SELR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M3DSEL : 4;
            unsigned char M3BSEL : 4;
        }
        BIT;
    }
    M3SELR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M4CSEL : 4;
            unsigned char M4ASEL : 4;
        }
        BIT;
    }
    M4SELR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M4DSEL : 4;
            unsigned char M4BSEL : 4;
        }
        BIT;
    }
    M4SELR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char M4G2SEL : 1;
            unsigned char M4G1SEL : 1;
            unsigned char M3G0SEL : 1;
        }
        BIT;
    }
    MGSELR;
};

