FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_port0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char : 1;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char : 1;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char : 1;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char : 1;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 3;
            unsigned char B2 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 62 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char : 1;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_port1
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 32 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 61 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_port2
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 33 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 60 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_port3
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 34 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 3;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 59 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_port4
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 35 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 58 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_port5
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 36 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 57 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 3;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_port6
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 37 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 56 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_port7
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 38 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 55 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

