FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_port8
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 2;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 2;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 2;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 2;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 39 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 54 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char : 2;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_port9
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 40 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 53 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_porta
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 41 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 52 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

