FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_portb
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 42 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 51 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_portc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 43 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 50 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_portd
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 44 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 49 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_porte
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 45 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 48 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_portf
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 46 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 47 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_portg
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 47 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 46 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        }
        BIT;
    }
    DSCR;
};

struct st_portj
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
        }
        BIT;
    }
    PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
        }
        BIT;
    }
    PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
        }
        BIT;
    }
    PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
        }
        BIT;
    }
    PMR;
    char wk3[ 49 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
        }
        BIT;
    }
    ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char B2 : 1;
        }
        BIT;
    }
    ODR1;
    char wk4[ 44 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char B5 : 1;
            unsigned char : 1;
            unsigned char B3 : 1;
        }
        BIT;
    }
    PCR;
};

struct st_ppg0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3CMS : 2;
            unsigned char G2CMS : 2;
            unsigned char G1CMS : 2;
            unsigned char G0CMS : 2;
        }
        BIT;
    }
    PCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3INV : 1;
            unsigned char G2INV : 1;
            unsigned char G1INV : 1;
            unsigned char G0INV : 1;
            unsigned char G3NOV : 1;
            unsigned char G2NOV : 1;
            unsigned char G1NOV : 1;
            unsigned char G0NOV : 1;
        }
        BIT;
    }
    PMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDER15 : 1;
            unsigned char NDER14 : 1;
            unsigned char NDER13 : 1;
            unsigned char NDER12 : 1;
            unsigned char NDER11 : 1;
            unsigned char NDER10 : 1;
            unsigned char NDER9 : 1;
            unsigned char NDER8 : 1;
        }
        BIT;
    }
    NDERH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDER7 : 1;
            unsigned char NDER6 : 1;
            unsigned char NDER5 : 1;
            unsigned char NDER4 : 1;
            unsigned char NDER3 : 1;
            unsigned char NDER2 : 1;
            unsigned char NDER1 : 1;
            unsigned char NDER0 : 1;
        }
        BIT;
    }
    NDERL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POD15 : 1;
            unsigned char POD14 : 1;
            unsigned char POD13 : 1;
            unsigned char POD12 : 1;
            unsigned char POD11 : 1;
            unsigned char POD10 : 1;
            unsigned char POD9 : 1;
            unsigned char POD8 : 1;
        }
        BIT;
    }
    PODRH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POD7 : 1;
            unsigned char POD6 : 1;
            unsigned char POD5 : 1;
            unsigned char POD4 : 1;
            unsigned char POD3 : 1;
            unsigned char POD2 : 1;
            unsigned char POD1 : 1;
            unsigned char POD0 : 1;
        }
        BIT;
    }
    PODRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDR15 : 1;
            unsigned char NDR14 : 1;
            unsigned char NDR13 : 1;
            unsigned char NDR12 : 1;
            unsigned char NDR11 : 1;
            unsigned char NDR10 : 1;
            unsigned char NDR9 : 1;
            unsigned char NDR8 : 1;
        }
        BIT;
    }
    NDRH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDR7 : 1;
            unsigned char NDR6 : 1;
            unsigned char NDR5 : 1;
            unsigned char NDR4 : 1;
            unsigned char NDR3 : 1;
            unsigned char NDR2 : 1;
            unsigned char NDR1 : 1;
            unsigned char NDR0 : 1;
        }
        BIT;
    }
    NDRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NDR11 : 1;
            unsigned char NDR10 : 1;
            unsigned char NDR9 : 1;
            unsigned char NDR8 : 1;
        }
        BIT;
    }
    NDRH2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NDR3 : 1;
            unsigned char NDR2 : 1;
            unsigned char NDR1 : 1;
            unsigned char NDR0 : 1;
        }
        BIT;
    }
    NDRL2;
};

