FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_qspi
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPRIE : 1;
            unsigned char SPE : 1;
            unsigned char SPTIE : 1;
            unsigned char : 1;
            unsigned char MSTR : 1;
            unsigned char : 1;
            unsigned char SPSSLIE : 1;
        }
        BIT;
    }
    SPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SSLP : 1;
        }
        BIT;
    }
    SSLP;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char MOIFE : 1;
            unsigned char MOIFV : 1;
            unsigned char : 1;
            unsigned char IO3FV : 1;
            unsigned char IO2FV : 1;
            unsigned char SPLP : 1;
        }
        BIT;
    }
    SPPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPRFF : 1;
            unsigned char TREND : 1;
            unsigned char SPTEF : 1;
            unsigned char SPSSLF : 1;
        }
        BIT;
    }
    SPSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
        }
        WORD;
        struct
        {
            unsigned char HH;
        }
        BYTE;
    }
    SPDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char SPSC : 2;
        }
        BIT;
    }
    SPSCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char SPSS : 2;
        }
        BIT;
    }
    SPSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPBR7 : 1;
            unsigned char SPBR6 : 1;
            unsigned char SPBR5 : 1;
            unsigned char SPBR4 : 1;
            unsigned char SPBR3 : 1;
            unsigned char SPBR2 : 1;
            unsigned char SPBR1 : 1;
            unsigned char SPBR0 : 1;
        }
        BIT;
    }
    SPBR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TXDMY : 1;
        }
        BIT;
    }
    SPDCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SCKDL : 3;
        }
        BIT;
    }
    SPCKD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SLNDL : 3;
        }
        BIT;
    }
    SSLND;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPNDL : 3;
        }
        BIT;
    }
    SPND;
    char wk0[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SPIMOD : 2;
            unsigned short SPRW : 1;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SPIMOD : 2;
            unsigned short SPRW : 1;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SPIMOD : 2;
            unsigned short SPRW : 1;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SPIMOD : 2;
            unsigned short SPRW : 1;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TXRST : 1;
            unsigned char RXRST : 1;
            unsigned char TXTRG : 2;
            unsigned char TXTRGEX : 1;
            unsigned char RXTRG : 3;
        }
        BIT;
    }
    SPBFCR;
    char wk1[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short TXBC : 6;
            unsigned short : 2;
            unsigned short RXBC : 6;
        }
        BIT;
    }
    SPBDCR;
    unsigned long SPBMUL0;
    unsigned long SPBMUL1;
    unsigned long SPBMUL2;
    unsigned long SPBMUL3;
};

struct st_ram
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char RAMMODE : 2;
        }
        BIT;
    }
    RAMMODE;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RAMERR : 1;
        }
        BIT;
    }
    RAMSTS;
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char KW : 7;
            unsigned char RAMPRCR : 1;
        }
        BIT;
    }
    RAMPRCR;
    char wk1[ 3 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long READ : 16;
            unsigned long : 3;
        }
        BIT;
    }
    RAMECAD;
};

struct st_riic
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ICE : 1;
            unsigned char IICRST : 1;
            unsigned char CLO : 1;
            unsigned char SOWP : 1;
            unsigned char SCLO : 1;
            unsigned char SDAO : 1;
            unsigned char SCLI : 1;
            unsigned char SDAI : 1;
        }
        BIT;
    }
    ICCR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BBSY : 1;
            unsigned char MST : 1;
            unsigned char TRS : 1;
            unsigned char : 1;
            unsigned char SP : 1;
            unsigned char RS : 1;
            unsigned char ST : 1;
        }
        BIT;
    }
    ICCR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char MTWP : 1;
            unsigned char CKS : 3;
            unsigned char BCWP : 1;
            unsigned char BC : 3;
        }
        BIT;
    }
    ICMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DLCS : 1;
            unsigned char SDDL : 3;
            unsigned char : 1;
            unsigned char TMOH : 1;
            unsigned char TMOL : 1;
            unsigned char TMOS : 1;
        }
        BIT;
    }
    ICMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SMBS : 1;
            unsigned char WAIT : 1;
            unsigned char RDRFS : 1;
            unsigned char ACKWP : 1;
            unsigned char ACKBT : 1;
            unsigned char ACKBR : 1;
            unsigned char NF : 2;
        }
        BIT;
    }
    ICMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FMPE : 1;
            unsigned char SCLE : 1;
            unsigned char NFE : 1;
            unsigned char NACKE : 1;
            unsigned char SALE : 1;
            unsigned char NALE : 1;
            unsigned char MALE : 1;
            unsigned char TMOE : 1;
        }
        BIT;
    }
    ICFER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char HOAE : 1;
            unsigned char : 1;
            unsigned char DIDE : 1;
            unsigned char : 1;
            unsigned char GCAE : 1;
            unsigned char SAR2E : 1;
            unsigned char SAR1E : 1;
            unsigned char SAR0E : 1;
        }
        BIT;
    }
    ICSER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char TEIE : 1;
            unsigned char RIE : 1;
            unsigned char NAKIE : 1;
            unsigned char SPIE : 1;
            unsigned char STIE : 1;
            unsigned char ALIE : 1;
            unsigned char TMOIE : 1;
        }
        BIT;
    }
    ICIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char HOA : 1;
            unsigned char : 1;
            unsigned char DID : 1;
            unsigned char : 1;
            unsigned char GCA : 1;
            unsigned char AAS2 : 1;
            unsigned char AAS1 : 1;
            unsigned char AAS0 : 1;
        }
        BIT;
    }
    ICSR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char TEND : 1;
            unsigned char RDRF : 1;
            unsigned char NACKF : 1;
            unsigned char STOP : 1;
            unsigned char START : 1;
            unsigned char AL : 1;
            unsigned char TMOF : 1;
        }
        BIT;
    }
    ICSR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA : 7;
            unsigned char SVA0 : 1;
        }
        BIT;
    }
    SARL0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SVA : 2;
            unsigned char FS : 1;
        }
        BIT;
    }
    SARU0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA : 7;
            unsigned char SVA0 : 1;
        }
        BIT;
    }
    SARL1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SVA : 2;
            unsigned char FS : 1;
        }
        BIT;
    }
    SARU1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA : 7;
            unsigned char SVA0 : 1;
        }
        BIT;
    }
    SARL2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SVA : 2;
            unsigned char FS : 1;
        }
        BIT;
    }
    SARU2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char BRL : 5;
        }
        BIT;
    }
    ICBRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char BRH : 5;
        }
        BIT;
    }
    ICBRH;
    unsigned char ICDRT;
    unsigned char ICDRR;
};

struct st_rspi
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPRIE : 1;
            unsigned char SPE : 1;
            unsigned char SPTIE : 1;
            unsigned char SPEIE : 1;
            unsigned char MSTR : 1;
            unsigned char MODFEN : 1;
            unsigned char TXMD : 1;
            unsigned char SPMS : 1;
        }
        BIT;
    }
    SPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char SSL3P : 1;
            unsigned char SSL2P : 1;
            unsigned char SSL1P : 1;
            unsigned char SSL0P : 1;
        }
        BIT;
    }
    SSLP;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char MOIFE : 1;
            unsigned char MOIFV : 1;
            unsigned char : 2;
            unsigned char SPLP2 : 1;
            unsigned char SPLP : 1;
        }
        BIT;
    }
    SPPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPRF : 1;
            unsigned char : 1;
            unsigned char SPTEF : 1;
            unsigned char : 1;
            unsigned char PERF : 1;
            unsigned char MODF : 1;
            unsigned char IDLNF : 1;
            unsigned char OVRF : 1;
        }
        BIT;
    }
    SPSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
        }
        WORD;
    }
    SPDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPSLN : 3;
        }
        BIT;
    }
    SPSCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char SPECM : 3;
            unsigned char : 1;
            unsigned char SPCP : 3;
        }
        BIT;
    }
    SPSSR;
    unsigned char SPBR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char SPLW : 1;
            unsigned char SPRDTD : 1;
            unsigned char : 2;
            unsigned char SPFC : 2;
        }
        BIT;
    }
    SPDCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SCKDL : 3;
        }
        BIT;
    }
    SPCKD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SLNDL : 3;
        }
        BIT;
    }
    SSLND;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPNDL : 3;
        }
        BIT;
    }
    SPND;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char SCKASE : 1;
            unsigned char PTE : 1;
            unsigned char SPIIE : 1;
            unsigned char SPOE : 1;
            unsigned char SPPE : 1;
        }
        BIT;
    }
    SPCR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD3;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD4;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD5;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD6;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD7;
};

