FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_rtc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char F1HZ : 1;
            unsigned char F2HZ : 1;
            unsigned char F4HZ : 1;
            unsigned char F8HZ : 1;
            unsigned char F16HZ : 1;
            unsigned char F32HZ : 1;
            unsigned char F64HZ : 1;
        }
        BIT;
    }
    R64CNT;
    char wk0[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char SEC10 : 3;
                unsigned char SEC1 : 4;
            }
            BIT;
        }
        RSECCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT0;
    };
    char wk1[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char MIN10 : 3;
                unsigned char MIN1 : 4;
            }
            BIT;
        }
        RMINCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT1;
    };
    char wk2[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char PM : 1;
                unsigned char HR10 : 2;
                unsigned char HR1 : 4;
            }
            BIT;
        }
        RHRCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT2;
    };
    char wk3[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char DAYW : 3;
            }
            BIT;
        }
        RWKCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT3;
    };
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char DATE10 : 2;
            unsigned char DATE1 : 4;
        }
        BIT;
    }
    RDAYCNT;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char MON10 : 1;
            unsigned char MON1 : 4;
        }
        BIT;
    }
    RMONCNT;
    char wk6[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short YR10 : 4;
            unsigned short YR1 : 4;
        }
        BIT;
    }
    RYRCNT;
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
                unsigned char SEC10 : 3;
                unsigned char SEC1 : 4;
            }
            BIT;
        }
        RSECAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT0AR;
    };
    char wk7[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
                unsigned char MIN10 : 3;
                unsigned char MIN1 : 4;
            }
            BIT;
        }
        RMINAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT1AR;
    };
    char wk8[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
                unsigned char PM : 1;
                unsigned char HR10 : 2;
                unsigned char HR1 : 4;
            }
            BIT;
        }
        RHRAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT2AR;
    };
    char wk9[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
                unsigned char : 4;
                unsigned char DAYW : 3;
            }
            BIT;
        }
        RWKAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT3AR;
    };
    char wk10[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
                unsigned char : 1;
                unsigned char DATE10 : 2;
                unsigned char DATE1 : 4;
            }
            BIT;
        }
        RDAYAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 8;
            }
            BIT;
        }
        BCNT0AER;
    };
    char wk11[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
                unsigned char : 2;
                unsigned char MON10 : 1;
                unsigned char MON1 : 4;
            }
            BIT;
        }
        RMONAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 8;
            }
            BIT;
        }
        BCNT1AER;
    };
    char wk12[ 1 ];
    union
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short YR10 : 4;
                unsigned short YR1 : 4;
            }
            BIT;
        }
        RYRAR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short ENB : 8;
            }
            BIT;
        }
        BCNT2AER;
    };
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 1;
            }
            BIT;
        }
        RYRAREN;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 8;
            }
            BIT;
        }
        BCNT3AER;
    };
    char wk13[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PES : 4;
            unsigned char RTCOS : 1;
            unsigned char PIE : 1;
            unsigned char CIE : 1;
            unsigned char AIE : 1;
        }
        BIT;
    }
    RCR1;
    char wk14[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CNTMD : 1;
            unsigned char HR24 : 1;
            unsigned char AADJP : 1;
            unsigned char AADJE : 1;
            unsigned char RTCOE : 1;
            unsigned char ADJ30 : 1;
            unsigned char RESET : 1;
            unsigned char START : 1;
        }
        BIT;
    }
    RCR2;
    char wk15[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char RTCDV : 3;
            unsigned char RTCEN : 1;
        }
        BIT;
    }
    RCR3;
    char wk16[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RCKSEL : 1;
        }
        BIT;
    }
    RCR4;
    char wk17[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short RFC : 1;
        }
        BIT;
    }
    RFRH;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RFC : 16;
        }
        BIT;
    }
    RFRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PMADJ : 2;
            unsigned char ADJ : 6;
        }
        BIT;
    }
    RADJ;
    char wk18[ 17 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCEN : 1;
            unsigned char : 1;
            unsigned char TCNF : 2;
            unsigned char : 1;
            unsigned char TCST : 1;
            unsigned char TCCT : 2;
        }
        BIT;
    }
    RTCCR0;
    char wk19[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCEN : 1;
            unsigned char : 1;
            unsigned char TCNF : 2;
            unsigned char : 1;
            unsigned char TCST : 1;
            unsigned char TCCT : 2;
        }
        BIT;
    }
    RTCCR1;
    char wk20[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCEN : 1;
            unsigned char : 1;
            unsigned char TCNF : 2;
            unsigned char : 1;
            unsigned char TCST : 1;
            unsigned char TCCT : 2;
        }
        BIT;
    }
    RTCCR2;
    char wk21[ 13 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char SEC10 : 3;
                unsigned char SEC1 : 4;
            }
            BIT;
        }
        RSECCP0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT0CP0;
    };
    char wk22[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char MIN10 : 3;
                unsigned char MIN1 : 4;
            }
            BIT;
        }
        RMINCP0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT1CP0;
    };
    char wk23[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char PM : 1;
                unsigned char HR10 : 2;
                unsigned char HR1 : 4;
            }
            BIT;
        }
        RHRCP0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT2CP0;
    };
    char wk24[ 3 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char DATE10 : 2;
                unsigned char DATE1 : 4;
            }
            BIT;
        }
        RDAYCP0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT3CP0;
    };
    char wk25[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char MON10 : 1;
            unsigned char MON1 : 4;
        }
        BIT;
    }
    RMONCP0;
    char wk26[ 5 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char SEC10 : 3;
                unsigned char SEC1 : 4;
            }
            BIT;
        }
        RSECCP1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT0CP1;
    };
    char wk27[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char MIN10 : 3;
                unsigned char MIN1 : 4;
            }
            BIT;
        }
        RMINCP1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT1CP1;
    };
    char wk28[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char PM : 1;
                unsigned char HR10 : 2;
                unsigned char HR1 : 4;
            }
            BIT;
        }
        RHRCP1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT2CP1;
    };
    char wk29[ 3 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char DATE10 : 2;
                unsigned char DATE1 : 4;
            }
            BIT;
        }
        RDAYCP1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT3CP1;
    };
    char wk30[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char MON10 : 1;
            unsigned char MON1 : 4;
        }
        BIT;
    }
    RMONCP1;
    char wk31[ 5 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char SEC10 : 3;
                unsigned char SEC1 : 4;
            }
            BIT;
        }
        RSECCP2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT0CP2;
    };
    char wk32[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char MIN10 : 3;
                unsigned char MIN1 : 4;
            }
            BIT;
        }
        RMINCP2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT1CP2;
    };
    char wk33[ 1 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char PM : 1;
                unsigned char HR10 : 2;
                unsigned char HR1 : 4;
            }
            BIT;
        }
        RHRCP2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT2CP2;
    };
    char wk34[ 3 ];
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char DATE10 : 2;
                unsigned char DATE1 : 4;
            }
            BIT;
        }
        RDAYCP2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT3CP2;
    };
    char wk35[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char MON10 : 1;
            unsigned char MON1 : 4;
        }
        BIT;
    }
    RMONCP2;
};

