FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_s12ad
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADST : 1;
            unsigned short ADCS : 2;
            unsigned short ADIE : 1;
            unsigned short : 2;
            unsigned short TRGE : 1;
            unsigned short EXTRG : 1;
            unsigned short DBLE : 1;
            unsigned short GBADIE : 1;
            unsigned short : 1;
            unsigned short DBLANS : 5;
        }
        BIT;
    }
    ADCSR;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSA0 : 16;
        }
        BIT;
    }
    ADANSA0;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADS0 : 16;
        }
        BIT;
    }
    ADADS0;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char AVEE : 1;
            unsigned char : 5;
            unsigned char ADC : 2;
        }
        BIT;
    }
    ADADC;
    char wk3[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADRFMT : 1;
            unsigned short : 3;
            unsigned short DIAGM : 1;
            unsigned short DIAGLD : 1;
            unsigned short DIAGVAL : 2;
            unsigned short : 2;
            unsigned short ACE : 1;
            unsigned short : 2;
            unsigned short ADPRC : 2;
        }
        BIT;
    }
    ADCER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short TRSA : 6;
            unsigned short : 2;
            unsigned short TRSB : 6;
        }
        BIT;
    }
    ADSTRGR;
    char wk4[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSB0 : 16;
        }
        BIT;
    }
    ADANSB0;
    char wk5[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short AD : 12;
        }
        BIT;
    }
    ADDBLDR;
    char wk6[ 4 ];
    union
    {
        unsigned short WORD;
        union
        {
            struct
            {
                unsigned short DIAGST : 2;
                unsigned short : 2;
                unsigned short AD : 12;
            }
            RIGHT;
            struct
            {
                unsigned short AD : 12;
                unsigned short : 2;
                unsigned short DIAGST : 2;
            }
            LEFT;
        }
        BIT;
    }
    ADRD;
    unsigned short ADDR0;
    unsigned short ADDR1;
    unsigned short ADDR2;
    unsigned short ADDR3;
    unsigned short ADDR4;
    unsigned short ADDR5;
    unsigned short ADDR6;
    unsigned short ADDR7;
    char wk7[ 48 ];
    unsigned char ADSSTR0;
    char wk8[ 5 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short SHANS : 3;
            unsigned short SSTSH : 8;
        }
        BIT;
    }
    ADSHCR;
    char wk9[ 11 ];
    unsigned char ADSSTR1;
    unsigned char ADSSTR2;
    unsigned char ADSSTR3;
    unsigned char ADSSTR4;
    unsigned char ADSSTR5;
    unsigned char ADSSTR6;
    unsigned char ADSSTR7;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ADNDIS : 5;
        }
        BIT;
    }
    ADDISCR;
    char wk9a[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SHMD : 1;
        }
        BIT;
    }
    ADSHMSR;
    char wk10[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short GBRP : 1;
            unsigned short : 13;
            unsigned short GBRSCN : 1;
            unsigned short PGS : 1;
        }
        BIT;
    }
    ADGSPCR;
    char wk11[ 2 ];
    unsigned short ADDBLDRA;
    unsigned short ADDBLDRB;
    char wk12[ 8 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMPIE : 1;
            unsigned char WCMPE : 1;
        }
        BIT;
    }
    ADCMPCR;
    char wk13[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPS0 : 16;
        }
        BIT;
    }
    ADCMPANSR0;
    char wk14[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPL0 : 16;
        }
        BIT;
    }
    ADCMPLR0;
    char wk15[ 2 ];
    unsigned short ADCMPDR0;
    unsigned short ADCMPDR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPF0 : 16;
        }
        BIT;
    }
    ADCMPSR0;
};

struct st_s12ad1
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADST : 1;
            unsigned short ADCS : 2;
            unsigned short ADIE : 1;
            unsigned short : 2;
            unsigned short TRGE : 1;
            unsigned short EXTRG : 1;
            unsigned short DBLE : 1;
            unsigned short GBADIE : 1;
            unsigned short : 1;
            unsigned short DBLANS : 5;
        }
        BIT;
    }
    ADCSR;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSA0 : 16;
        }
        BIT;
    }
    ADANSA0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ANSA1 : 5;
        }
        BIT;
    }
    ADANSA1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADS0 : 16;
        }
        BIT;
    }
    ADADS0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ADS1 : 5;
        }
        BIT;
    }
    ADADS1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char AVEE : 1;
            unsigned char : 5;
            unsigned char ADC : 2;
        }
        BIT;
    }
    ADADC;
    char wk1[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADRFMT : 1;
            unsigned short : 3;
            unsigned short DIAGM : 1;
            unsigned short DIAGLD : 1;
            unsigned short DIAGVAL : 2;
            unsigned short : 2;
            unsigned short ACE : 1;
            unsigned short : 2;
            unsigned short ADPRC : 2;
        }
        BIT;
    }
    ADCER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short TRSA : 6;
            unsigned short : 2;
            unsigned short TRSB : 6;
        }
        BIT;
    }
    ADSTRGR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short EXOEN : 1;
            unsigned short EXSEL : 2;
            unsigned short : 1;
            unsigned short OCSB : 1;
            unsigned short TSSB : 1;
            unsigned short OCSA : 1;
            unsigned short TSSA : 1;
            unsigned short : 6;
            unsigned short OCSAD : 1;
            unsigned short TSSAD : 1;
        }
        BIT;
    }
    ADEXICR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSB0 : 16;
        }
        BIT;
    }
    ADANSB0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ANSB1 : 5;
        }
        BIT;
    }
    ADANSB1;
    unsigned short ADDBLDR;
    unsigned short ADTSDR;
    unsigned short ADOCDR;
    union
    {
        unsigned short WORD;
        union
        {
            struct
            {
                unsigned short DIAGST : 2;
                unsigned short : 2;
                unsigned short AD : 12;
            }
            RIGHT;
            struct
            {
                unsigned short AD : 12;
                unsigned short : 2;
                unsigned short DIAGST : 2;
            }
            LEFT;
        }
        BIT;
    }
    ADRD;
    unsigned short ADDR0;
    unsigned short ADDR1;
    unsigned short ADDR2;
    unsigned short ADDR3;
    unsigned short ADDR4;
    unsigned short ADDR5;
    unsigned short ADDR6;
    unsigned short ADDR7;
    unsigned short ADDR8;
    unsigned short ADDR9;
    unsigned short ADDR10;
    unsigned short ADDR11;
    unsigned short ADDR12;
    unsigned short ADDR13;
    unsigned short ADDR14;
    unsigned short ADDR15;
    unsigned short ADDR16;
    unsigned short ADDR17;
    unsigned short ADDR18;
    unsigned short ADDR19;
    unsigned short ADDR20;
    char wk2[ 22 ];
    unsigned char ADSSTR0;
    unsigned char ADSSTRL;
    char wk3[ 14 ];
    unsigned char ADSSTRT;
    unsigned char ADSSTRO;
    char wk4[ 1 ];
    unsigned char ADSSTR1;
    unsigned char ADSSTR2;
    unsigned char ADSSTR3;
    unsigned char ADSSTR4;
    unsigned char ADSSTR5;
    unsigned char ADSSTR6;
    unsigned char ADSSTR7;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ADNDIS : 5;
        }
        BIT;
    }
    ADDISCR;
    char wk5[ 5 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short GBRP : 1;
            unsigned short : 13;
            unsigned short GBRSCN : 1;
            unsigned short PGS : 1;
        }
        BIT;
    }
    ADGSPCR;
    char wk6[ 2 ];
    unsigned short ADDBLDRA;
    unsigned short ADDBLDRB;
    char wk7[ 8 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMPIE : 1;
            unsigned char WCMPE : 1;
        }
        BIT;
    }
    ADCMPCR;
    char wk8[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMPSOC : 1;
            unsigned char CMPSTS : 1;
        }
        BIT;
    }
    ADCMPANSER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMPLOC : 1;
            unsigned char CMPLTS : 1;
        }
        BIT;
    }
    ADCMPLER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPS0 : 16;
        }
        BIT;
    }
    ADCMPANSR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short CMPS1 : 5;
        }
        BIT;
    }
    ADCMPANSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPL0 : 16;
        }
        BIT;
    }
    ADCMPLR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short CMPL1 : 5;
        }
        BIT;
    }
    ADCMPLR1;
    unsigned short ADCMPDR0;
    unsigned short ADCMPDR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPF0 : 16;
        }
        BIT;
    }
    ADCMPSR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short CMPF1 : 5;
        }
        BIT;
    }
    ADCMPSR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMPFOC : 1;
            unsigned char CMPFTS : 1;
        }
        BIT;
    }
    ADCMPSER;
};

struct st_sci0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CM : 1;
            unsigned char CHR : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char STOP : 1;
            unsigned char MP : 1;
            unsigned char CKS : 2;
        }
        BIT;
    }
    SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        }
        BIT;
    }
    SCR;
    unsigned char TDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char FER : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
            unsigned char MPB : 1;
            unsigned char MPBT : 1;
        }
        BIT;
    }
    SSR;
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 2;
            unsigned char CHR1 : 1;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        }
        BIT;
    }
    SCMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RXDESEL : 1;
            unsigned char BGDM : 1;
            unsigned char NFEN : 1;
            unsigned char ABCS : 1;
            unsigned char : 1;
            unsigned char BRME : 1;
            unsigned char : 1;
            unsigned char ACS0 : 1;
        }
        BIT;
    }
    SEMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char NFCS : 3;
        }
        BIT;
    }
    SNFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICDL : 5;
            unsigned char : 2;
            unsigned char IICM : 1;
        }
        BIT;
    }
    SIMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char IICACKT : 1;
            unsigned char : 3;
            unsigned char IICCSC : 1;
            unsigned char IICINTM : 1;
        }
        BIT;
    }
    SIMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICSCLS : 2;
            unsigned char IICSDAS : 2;
            unsigned char IICSTIF : 1;
            unsigned char IICSTPREQ : 1;
            unsigned char IICRSTAREQ : 1;
            unsigned char IICSTAREQ : 1;
        }
        BIT;
    }
    SIMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char IICACKR : 1;
        }
        BIT;
    }
    SISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CKPH : 1;
            unsigned char CKPOL : 1;
            unsigned char : 1;
            unsigned char MFF : 1;
            unsigned char : 1;
            unsigned char MSS : 1;
            unsigned char CTSE : 1;
            unsigned char SSE : 1;
        }
        BIT;
    }
    SPMR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char TDRH;
            unsigned char TDRL;
        }
        BYTE;
    }
    TDRHL;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char RDRH;
            unsigned char RDRL;
        }
        BYTE;
    }
    RDRHL;
    unsigned char MDDR;
};

struct st_sci12
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CM : 1;
            unsigned char CHR : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char STOP : 1;
            unsigned char MP : 1;
            unsigned char CKS : 2;
        }
        BIT;
    }
    SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        }
        BIT;
    }
    SCR;
    unsigned char TDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char FER : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
            unsigned char MPB : 1;
            unsigned char MPBT : 1;
        }
        BIT;
    }
    SSR;
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 2;
            unsigned char CHR1 : 1;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        }
        BIT;
    }
    SCMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RXDESEL : 1;
            unsigned char BGDM : 1;
            unsigned char NFEN : 1;
            unsigned char ABCS : 1;
            unsigned char : 1;
            unsigned char BRME : 1;
            unsigned char : 1;
            unsigned char ACS0 : 1;
        }
        BIT;
    }
    SEMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char NFCS : 3;
        }
        BIT;
    }
    SNFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICDL : 5;
            unsigned char : 2;
            unsigned char IICM : 1;
        }
        BIT;
    }
    SIMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char IICACKT : 1;
            unsigned char : 3;
            unsigned char IICCSC : 1;
            unsigned char IICINTM : 1;
        }
        BIT;
    }
    SIMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICSCLS : 2;
            unsigned char IICSDAS : 2;
            unsigned char IICSTIF : 1;
            unsigned char IICSTPREQ : 1;
            unsigned char IICRSTAREQ : 1;
            unsigned char IICSTAREQ : 1;
        }
        BIT;
    }
    SIMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char IICACKR : 1;
        }
        BIT;
    }
    SISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CKPH : 1;
            unsigned char CKPOL : 1;
            unsigned char : 1;
            unsigned char MFF : 1;
            unsigned char : 1;
            unsigned char MSS : 1;
            unsigned char CTSE : 1;
            unsigned char SSE : 1;
        }
        BIT;
    }
    SPMR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char TDRH;
            unsigned char TDRL;
        }
        BYTE;
    }
    TDRHL;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char RDRH;
            unsigned char RDRL;
        }
        BYTE;
    }
    RDRHL;
    unsigned char MDDR;
    char wk0[ 13 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char ESME : 1;
        }
        BIT;
    }
    ESMER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char BRME : 1;
            unsigned char RXDSF : 1;
            unsigned char SFSF : 1;
        }
        BIT;
    }
    CR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIBS : 3;
            unsigned char PIBE : 1;
            unsigned char CF1DS : 2;
            unsigned char CF0RE : 1;
            unsigned char BFE : 1;
        }
        BIT;
    }
    CR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RTS : 2;
            unsigned char BCCS : 2;
            unsigned char : 1;
            unsigned char DFCS : 3;
        }
        BIT;
    }
    CR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SDST : 1;
        }
        BIT;
    }
    CR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char SHARPS : 1;
            unsigned char : 2;
            unsigned char RXDXPS : 1;
            unsigned char TXDXPS : 1;
        }
        BIT;
    }
    PCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char AEDIE : 1;
            unsigned char BCDIE : 1;
            unsigned char PIBDIE : 1;
            unsigned char CF1MIE : 1;
            unsigned char CF0MIE : 1;
            unsigned char BFDIE : 1;
        }
        BIT;
    }
    ICR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char AEDF : 1;
            unsigned char BCDF : 1;
            unsigned char PIBDF : 1;
            unsigned char CF1MF : 1;
            unsigned char CF0MF : 1;
            unsigned char BFDF : 1;
        }
        BIT;
    }
    STR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char AEDCL : 1;
            unsigned char BCDCL : 1;
            unsigned char PIBDCL : 1;
            unsigned char CF1MCL : 1;
            unsigned char CF0MCL : 1;
            unsigned char BFDCL : 1;
        }
        BIT;
    }
    STCR;
    unsigned char CF0DR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CF0CE7 : 1;
            unsigned char CF0CE6 : 1;
            unsigned char CF0CE5 : 1;
            unsigned char CF0CE4 : 1;
            unsigned char CF0CE3 : 1;
            unsigned char CF0CE2 : 1;
            unsigned char CF0CE1 : 1;
            unsigned char CF0CE0 : 1;
        }
        BIT;
    }
    CF0CR;
    unsigned char CF0RR;
    unsigned char PCF1DR;
    unsigned char SCF1DR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CF1CE7 : 1;
            unsigned char CF1CE6 : 1;
            unsigned char CF1CE5 : 1;
            unsigned char CF1CE4 : 1;
            unsigned char CF1CE3 : 1;
            unsigned char CF1CE2 : 1;
            unsigned char CF1CE1 : 1;
            unsigned char CF1CE0 : 1;
        }
        BIT;
    }
    CF1CR;
    unsigned char CF1RR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TCST : 1;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char TCSS : 3;
            unsigned char TWRC : 1;
            unsigned char : 1;
            unsigned char TOMS : 2;
        }
        BIT;
    }
    TMR;
    unsigned char TPRE;
    unsigned char TCNT;
};

