FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_scifa
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short CM : 1;
            unsigned short CHR : 1;
            unsigned short PE : 1;
            unsigned short PM : 1;
            unsigned short STOP : 1;
            unsigned short : 1;
            unsigned short CKS : 2;
        }
        BIT;
    }
    SMR;
/*	unsigned char  BRR; */
    union
    {
        unsigned char BRR;
        unsigned char MDDR;
    };
    char wk0[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short TIE : 1;
            unsigned short RIE : 1;
            unsigned short TE : 1;
            unsigned short RE : 1;
            unsigned short REIE : 1;
            unsigned short TEIE : 1;
            unsigned short CKE : 2;
        }
        BIT;
    }
    SCR;
    unsigned char FTDR;
    char wk1[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ER : 1;
            unsigned short TEND : 1;
            unsigned short TDFE : 1;
            unsigned short BRK : 1;
            unsigned short FER : 1;
            unsigned short PER : 1;
            unsigned short RDF : 1;
            unsigned short DR : 1;
        }
        BIT;
    }
    FSR;
    unsigned char FRDR;
    char wk2[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short RSTRG : 3;
            unsigned short RTRG : 2;
            unsigned short TTRG : 2;
            unsigned short MCE : 1;
            unsigned short TFRST : 1;
            unsigned short RFRST : 1;
            unsigned short LOOP : 1;
        }
        BIT;
    }
    FCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short T : 5;
            unsigned short : 3;
            unsigned short R : 5;
        }
        BIT;
    }
    FDR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short RTS2IO : 1;
            unsigned short RTS2DT : 1;
            unsigned short CTS2IO : 1;
            unsigned short CTS2DT : 1;
            unsigned short SCKIO : 1;
            unsigned short SCKDT : 1;
            unsigned short SPB2IO : 1;
            unsigned short SPB2DT : 1;
        }
        BIT;
    }
    SPTR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short PER : 4;
            unsigned short : 2;
            unsigned short FER : 4;
            unsigned short : 1;
            unsigned short ORER : 1;
        }
        BIT;
    }
    LSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BGDM : 1;
            unsigned char : 1;
            unsigned char BRME : 1;
            unsigned char MDDRS : 1;
            unsigned char DIR : 1;
            unsigned char NFEN : 1;
            unsigned char : 1;
            unsigned char ABCS0 : 1;
        }
        BIT;
    }
    SEMR;
    char wk3[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RTRGS : 1;
            unsigned short : 2;
            unsigned short RFTC : 5;
            unsigned short TTRGS : 1;
            unsigned short : 2;
            unsigned short TFTC : 5;
        }
        BIT;
    }
    FTCR;
};

struct st_sdhi
{
    union
    {
        unsigned long LONG;
/*		struct { */
/*			unsigned long :16; */
/*			unsigned long CMD12AT:2; */
/*			unsigned long TRSTP:1; */
/*			unsigned long CMDRW:1; */
/*			unsigned long CMDTP:1; */
/*			unsigned long RSPTP:3; */
/*			unsigned long ACMD:2; */
/*			unsigned long CMDIDX:6; */
/*		} BIT; */
    }
    SDCMD;
    char wk0[ 4 ];
    unsigned long SDARG;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 23;
            unsigned long SDBLKCNTEN : 1;
            unsigned long : 7;
            unsigned long STP : 1;
        }
        BIT;
    }
    SDSTOP;
    unsigned long SDBLKCNT;
    unsigned long SDRSP10;
    char wk2[ 4 ];
    unsigned long SDRSP32;
    char wk3[ 4 ];
    unsigned long SDRSP54;
    char wk4[ 4 ];
    unsigned long SDRSP76;
    char wk5[ 4 ];
    union
    {
        unsigned long LONG;
/*		struct { */
/*			unsigned long :21; */
/*			unsigned long SDD3MON:1; */
/*			unsigned long SDD3IN:1; */
/*			unsigned long SDD3RM:1; */
/*			unsigned long SDWPMON:1; */
/*			unsigned long :1; */
/*			unsigned long SDCDMON:1; */
/*			unsigned long SDCDIN:1; */
/*			unsigned long SDCDRM:1; */
/*			unsigned long ACEND:1; */
/*			unsigned long :1; */
/*			unsigned long RSPEND:1; */
/*		} BIT; */
    }
    SDSTS1;
    union
    {
        unsigned long LONG;
/*		struct { */
/*			unsigned long :16; */
/*			unsigned long ILA:1; */
/*			unsigned long CBSY:1; */
/*			unsigned long SDCLKCREN:1; */
/*			unsigned long :3; */
/*			unsigned long BWE:1; */
/*			unsigned long BRE:1; */
/*			unsigned long SDD0MON:1; */
/*			unsigned long RSPTO:1; */
/*			unsigned long ILR:1; */
/*			unsigned long ILW:1; */
/*			unsigned long DTO:1; */
/*			unsigned long ENDE:1; */
/*			unsigned long CRCE:1; */
/*			unsigned long CMDE:1; */
/*		} BIT; */
    }
    SDSTS2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long SDD3INM : 1;
            unsigned long SDD3RMM : 1;
            unsigned long : 3;
            unsigned long SDCDINM : 1;
            unsigned long SDCDRMM : 1;
            unsigned long ACENDM : 1;
            unsigned long : 1;
            unsigned long RSPENDM : 1;
        }
        BIT;
    }
    SDIMSK1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long ILAM : 1;
            unsigned long : 5;
            unsigned long BWEM : 1;
            unsigned long BREM : 1;
            unsigned long : 1;
            unsigned long RSPTOM : 1;
            unsigned long ILRM : 1;
            unsigned long ILWM : 1;
            unsigned long DTTOM : 1;
            unsigned long ENDEM : 1;
            unsigned long CRCEM : 1;
            unsigned long CMDEM : 1;
        }
        BIT;
    }
    SDIMSK2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long CLKCTRLEN : 1;
            unsigned long CLKEN : 1;
            unsigned long CLKSEL : 8;
        }
        BIT;
    }
    SDCLKCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long LEN : 10;
        }
        BIT;
    }
    SDSIZE;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long WIDTH : 1;
            unsigned long : 7;
            unsigned long TOP : 4;
            unsigned long CTOP : 4;
        }
        BIT;
    }
    SDOPT;
    char wk6[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long CRCTK : 3;
            unsigned long CRCTKE : 1;
            unsigned long RDCRCE : 1;
            unsigned long RSPCRCE1 : 1;
            unsigned long RSPCRCE0 : 1;
            unsigned long : 2;
            unsigned long CRCLENE : 1;
            unsigned long RDLENE : 1;
            unsigned long RSPLENE1 : 1;
            unsigned long RSPLENE0 : 1;
            unsigned long CMDE1 : 1;
            unsigned long CMDE0 : 1;
        }
        BIT;
    }
    SDERSTS1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long CRCBSYTO : 1;
            unsigned long CRCTO : 1;
            unsigned long RDTO : 1;
            unsigned long BSYTO1 : 1;
            unsigned long BSYTO0 : 1;
            unsigned long RSPTO1 : 1;
            unsigned long RSPTO0 : 1;
        }
        BIT;
    }
    SDERSTS2;
    unsigned long SDBUFR;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long C52PUB : 1;
            unsigned long IOABT : 1;
            unsigned long : 5;
            unsigned long RWREQ : 1;
            unsigned long : 1;
            unsigned long INTEN : 1;
        }
        BIT;
    }
    SDIOMD;
    union
    {
        unsigned long LONG;
/*		struct { */
/*			unsigned long :16; */
/*			unsigned long EXWT:1; */
/*			unsigned long EXPUB52:1; */
/*			unsigned long :13; */
/*			unsigned long IOIRQ:1; */
/*		} BIT; */
    }
    SDIOSTS;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long EXWTM : 1;
            unsigned long EXPUB52M : 1;
            unsigned long : 13;
            unsigned long IOIRQM : 1;
        }
        BIT;
    }
    SDIOIMSK;
    char wk8[ 316 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long DMAEN : 1;
        }
        BIT;
    }
    SDDMAEN;
    char wk9[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long SDRST : 1;
        }
        BIT;
    }
    SDRST;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long CPRM : 1;
            unsigned long CLKRAT : 1;
            unsigned long : 2;
            unsigned long IP2 : 4;
            unsigned long IP1 : 8;
        }
        BIT;
    }
    SDVER;
    char wk10[ 24 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long BRSWP : 1;
            unsigned long BWSWP : 1;
        }
        BIT;
    }
    SDSWAP;
};

