FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_tmr0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMIEB : 1;
            unsigned char CMIEA : 1;
            unsigned char OVIE : 1;
            unsigned char CCLR : 2;
        }
        BIT;
    }
    TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ADTE : 1;
            unsigned char OSB : 2;
            unsigned char OSA : 2;
        }
        BIT;
    }
    TCSR;
    char wk1[ 1 ];
    unsigned char TCORA;
    char wk2[ 1 ];
    unsigned char TCORB;
    char wk3[ 1 ];
    unsigned char TCNT;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TMRIS : 1;
            unsigned char : 2;
            unsigned char CSS : 2;
            unsigned char CKS : 3;
        }
        BIT;
    }
    TCCR;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TCS : 1;
        }
        BIT;
    }
    TCSTR;
};

struct st_tmr1
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMIEB : 1;
            unsigned char CMIEA : 1;
            unsigned char OVIE : 1;
            unsigned char CCLR : 2;
        }
        BIT;
    }
    TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char OSB : 2;
            unsigned char OSA : 2;
        }
        BIT;
    }
    TCSR;
    char wk1[ 1 ];
    unsigned char TCORA;
    char wk2[ 1 ];
    unsigned char TCORB;
    char wk3[ 1 ];
    unsigned char TCNT;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TMRIS : 1;
            unsigned char : 2;
            unsigned char CSS : 2;
            unsigned char CKS : 3;
        }
        BIT;
    }
    TCCR;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TCS : 1;
        }
        BIT;
    }
    TCSTR;
};

struct st_tmr01
{
    unsigned short TCORA;
    unsigned short TCORB;
    unsigned short TCNT;
    unsigned short TCCR;
};

struct st_tpu0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR;
    char wk0[ 7 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ICSELD : 1;
            unsigned char ICSELB : 1;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char TCFV : 1;
            unsigned char TGFD : 1;
            unsigned char TGFC : 1;
            unsigned char TGFB : 1;
            unsigned char TGFA : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    unsigned short TGRC;
    unsigned short TGRD;
};

struct st_tpu1
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char : 2;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR;
    char wk1[ 22 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ICSELB : 1;
            unsigned char : 2;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIOR;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 1;
            unsigned char TCFU : 1;
            unsigned char TCFV : 1;
            unsigned char : 2;
            unsigned char TGFB : 1;
            unsigned char TGFA : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
};

struct st_tpu2
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char : 2;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR;
    char wk0[ 37 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ICSELB : 1;
            unsigned char : 2;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIOR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 1;
            unsigned char TCFU : 1;
            unsigned char TCFV : 1;
            unsigned char : 2;
            unsigned char TGFB : 1;
            unsigned char TGFA : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
};

