FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
struct st_tpu3
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR;
    char wk1[ 52 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ICSELD : 1;
            unsigned char ICSELB : 1;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char TCFV : 1;
            unsigned char TGFD : 1;
            unsigned char TGFC : 1;
            unsigned char TGFB : 1;
            unsigned char TGFA : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    unsigned short TGRC;
    unsigned short TGRD;
};

struct st_tpu4
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char : 2;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR;
    char wk0[ 67 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ICSELB : 1;
            unsigned char : 2;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIOR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 1;
            unsigned char TCFU : 1;
            unsigned char TCFV : 1;
            unsigned char : 2;
            unsigned char TGFB : 1;
            unsigned char TGFA : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
};

struct st_tpu5
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char : 2;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        }
        BIT;
    }
    NFCR;
    char wk1[ 82 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ICSELB : 1;
            unsigned char : 2;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIOR;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 1;
            unsigned char TCFU : 1;
            unsigned char TCFV : 1;
            unsigned char : 2;
            unsigned char TGFB : 1;
            unsigned char TGFA : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
};

struct st_tpua
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char CST5 : 1;
            unsigned char CST4 : 1;
            unsigned char CST3 : 1;
            unsigned char CST2 : 1;
            unsigned char CST1 : 1;
            unsigned char CST0 : 1;
        }
        BIT;
    }
    TSTR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char SYNC5 : 1;
            unsigned char SYNC4 : 1;
            unsigned char SYNC3 : 1;
            unsigned char SYNC2 : 1;
            unsigned char SYNC1 : 1;
            unsigned char SYNC0 : 1;
        }
        BIT;
    }
    TSYR;
};

