FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
#define IEN_BSC_BUSERR          IEN0
#define IEN_RAM_RAMERR          IEN2
#define IEN_FCU_FIFERR          IEN5
#define IEN_FCU_FRDYI           IEN7
#define IEN_ICU_SWINT2          IEN2
#define IEN_ICU_SWINT           IEN3
#define IEN_CMT0_CMI0           IEN4
#define IEN_CMT1_CMI1           IEN5
#define IEN_CMTW0_CMWI0         IEN6
#define IEN_CMTW1_CMWI1         IEN7
#define IEN_USBA_D0FIFO2        IEN0
#define IEN_USBA_D1FIFO2        IEN1
#define IEN_USB0_D0FIFO0        IEN2
#define IEN_USB0_D1FIFO0        IEN3
#define IEN_RSPI0_SPRI0         IEN6
#define IEN_RSPI0_SPTI0         IEN7
#define IEN_RSPI1_SPRI1         IEN0
#define IEN_RSPI1_SPTI1         IEN1
#define IEN_QSPI_SPRI           IEN2
#define IEN_QSPI_SPTI           IEN3
#define IEN_SDHI_SBFAI          IEN4
#define IEN_MMCIF_MBFAI         IEN5
#define IEN_SSI0_SSITXI0        IEN6
#define IEN_SSI0_SSIRXI0        IEN7
#define IEN_SSI1_SSIRTI1        IEN0
#define IEN_SRC_IDEI            IEN2
#define IEN_SRC_ODFI            IEN3
#define IEN_RIIC0_RXI0          IEN4
#define IEN_RIIC0_TXI0          IEN5
#define IEN_RIIC2_RXI2          IEN6
#define IEN_RIIC2_TXI2          IEN7
#define IEN_SCI0_RXI0           IEN2
#define IEN_SCI0_TXI0           IEN3
#define IEN_SCI1_RXI1           IEN4
#define IEN_SCI1_TXI1           IEN5
#define IEN_SCI2_RXI2           IEN6
#define IEN_SCI2_TXI2           IEN7
#define IEN_ICU_IRQ0            IEN0
#define IEN_ICU_IRQ1            IEN1
#define IEN_ICU_IRQ2            IEN2
#define IEN_ICU_IRQ3            IEN3
#define IEN_ICU_IRQ4            IEN4
#define IEN_ICU_IRQ5            IEN5
#define IEN_ICU_IRQ6            IEN6
#define IEN_ICU_IRQ7            IEN7
#define IEN_ICU_IRQ8            IEN0
#define IEN_ICU_IRQ9            IEN1
#define IEN_ICU_IRQ10           IEN2
#define IEN_ICU_IRQ11           IEN3
#define IEN_ICU_IRQ12           IEN4
#define IEN_ICU_IRQ13           IEN5
#define IEN_ICU_IRQ14           IEN6
#define IEN_ICU_IRQ15           IEN7
#define IEN_SCI3_RXI3           IEN0
#define IEN_SCI3_TXI3           IEN1
#define IEN_SCI4_RXI4           IEN2
#define IEN_SCI4_TXI4           IEN3
#define IEN_SCI5_RXI5           IEN4
#define IEN_SCI5_TXI5           IEN5
#define IEN_SCI6_RXI6           IEN6
#define IEN_SCI6_TXI6           IEN7
#define IEN_LVD1_LVD1           IEN0
#define IEN_LVD2_LVD2           IEN1
#define IEN_USB0_USBR0          IEN2
#define IEN_RTC_ALM             IEN4
#define IEN_RTC_PRD             IEN5
#define IEN_USBA_USBAR          IEN6
#define IEN_IWDT_IWUNI          IEN7
#define IEN_WDT_WUNI            IEN0
#define IEN_PDC_PCDFI           IEN1
#define IEN_SCI7_RXI7           IEN2
#define IEN_SCI7_TXI7           IEN3
#define IEN_SCIFA8_RXIF8        IEN4
#define IEN_SCIFA8_TXIF8        IEN5
#define IEN_SCIFA9_RXIF9        IEN6
#define IEN_SCIFA9_TXIF9        IEN7
#define IEN_SCIFA10_RXIF10      IEN0
#define IEN_SCIFA10_TXIF10      IEN1
#define IEN_ICU_GROUPBE0        IEN2
#define IEN_ICU_GROUPBL0        IEN6
#define IEN_ICU_GROUPBL1        IEN7
#define IEN_ICU_GROUPAL0        IEN0
#define IEN_ICU_GROUPAL1        IEN1
#define IEN_SCIFA11_RXIF11      IEN2
#define IEN_SCIFA11_TXIF11      IEN3
#define IEN_SCI12_RXI12         IEN4
#define IEN_SCI12_TXI12         IEN5
#define IEN_DMAC_DMAC0I         IEN0
#define IEN_DMAC_DMAC1I         IEN1
#define IEN_DMAC_DMAC2I         IEN2
#define IEN_DMAC_DMAC3I         IEN3
#define IEN_DMAC_DMAC74I        IEN4
#define IEN_OST_OST             IEN5
#define IEN_EXDMAC_EXDMAC0I     IEN6
#define IEN_EXDMAC_EXDMAC1I     IEN7
#define IEN_PERIB_INTB128       IEN0
#define IEN_PERIB_INTB129       IEN1
#define IEN_PERIB_INTB130       IEN2
#define IEN_PERIB_INTB131       IEN3
#define IEN_PERIB_INTB132       IEN4
#define IEN_PERIB_INTB133       IEN5
#define IEN_PERIB_INTB134       IEN6
#define IEN_PERIB_INTB135       IEN7
#define IEN_PERIB_INTB136       IEN0
#define IEN_PERIB_INTB137       IEN1
#define IEN_PERIB_INTB138       IEN2
#define IEN_PERIB_INTB139       IEN3
#define IEN_PERIB_INTB140       IEN4
#define IEN_PERIB_INTB141       IEN5
#define IEN_PERIB_INTB142       IEN6
#define IEN_PERIB_INTB143       IEN7
#define IEN_PERIB_INTB144       IEN0
#define IEN_PERIB_INTB145       IEN1
#define IEN_PERIB_INTB146       IEN2
#define IEN_PERIB_INTB147       IEN3
#define IEN_PERIB_INTB148       IEN4
#define IEN_PERIB_INTB149       IEN5
#define IEN_PERIB_INTB150       IEN6
#define IEN_PERIB_INTB151       IEN7
#define IEN_PERIB_INTB152       IEN0
#define IEN_PERIB_INTB153       IEN1
#define IEN_PERIB_INTB154       IEN2
#define IEN_PERIB_INTB155       IEN3
#define IEN_PERIB_INTB156       IEN4
#define IEN_PERIB_INTB157       IEN5
#define IEN_PERIB_INTB158       IEN6
#define IEN_PERIB_INTB159       IEN7
#define IEN_PERIB_INTB160       IEN0
#define IEN_PERIB_INTB161       IEN1
#define IEN_PERIB_INTB162       IEN2
#define IEN_PERIB_INTB163       IEN3
#define IEN_PERIB_INTB164       IEN4
#define IEN_PERIB_INTB165       IEN5
#define IEN_PERIB_INTB166       IEN6
#define IEN_PERIB_INTB167       IEN7
#define IEN_PERIB_INTB168       IEN0
#define IEN_PERIB_INTB169       IEN1
#define IEN_PERIB_INTB170       IEN2
#define IEN_PERIB_INTB171       IEN3
#define IEN_PERIB_INTB172       IEN4
#define IEN_PERIB_INTB173       IEN5
#define IEN_PERIB_INTB174       IEN6
#define IEN_PERIB_INTB175       IEN7
#define IEN_PERIB_INTB176       IEN0
#define IEN_PERIB_INTB177       IEN1
#define IEN_PERIB_INTB178       IEN2
#define IEN_PERIB_INTB179       IEN3
#define IEN_PERIB_INTB180       IEN4
#define IEN_PERIB_INTB181       IEN5
#define IEN_PERIB_INTB182       IEN6
#define IEN_PERIB_INTB183       IEN7
#define IEN_PERIB_INTB184       IEN0
#define IEN_PERIB_INTB185       IEN1
#define IEN_PERIB_INTB186       IEN2
#define IEN_PERIB_INTB187       IEN3
#define IEN_PERIB_INTB188       IEN4
#define IEN_PERIB_INTB189       IEN5
#define IEN_PERIB_INTB190       IEN6
#define IEN_PERIB_INTB191       IEN7
#define IEN_PERIB_INTB192       IEN0
#define IEN_PERIB_INTB193       IEN1
#define IEN_PERIB_INTB194       IEN2
#define IEN_PERIB_INTB195       IEN3
#define IEN_PERIB_INTB196       IEN4
#define IEN_PERIB_INTB197       IEN5
#define IEN_PERIB_INTB198       IEN6
#define IEN_PERIB_INTB199       IEN7
#define IEN_PERIB_INTB200       IEN0
#define IEN_PERIB_INTB201       IEN1
#define IEN_PERIB_INTB202       IEN2
#define IEN_PERIB_INTB203       IEN3
#define IEN_PERIB_INTB204       IEN4
#define IEN_PERIB_INTB205       IEN5
#define IEN_PERIB_INTB206       IEN6
#define IEN_PERIB_INTB207       IEN7
#define IEN_PERIA_INTA208       IEN0
#define IEN_PERIA_INTA209       IEN1
#define IEN_PERIA_INTA210       IEN2
#define IEN_PERIA_INTA211       IEN3
#define IEN_PERIA_INTA212       IEN4
#define IEN_PERIA_INTA213       IEN5
#define IEN_PERIA_INTA214       IEN6
#define IEN_PERIA_INTA215       IEN7
#define IEN_PERIA_INTA216       IEN0
#define IEN_PERIA_INTA217       IEN1
#define IEN_PERIA_INTA218       IEN2
#define IEN_PERIA_INTA219       IEN3
#define IEN_PERIA_INTA220       IEN4
#define IEN_PERIA_INTA221       IEN5
#define IEN_PERIA_INTA222       IEN6
#define IEN_PERIA_INTA223       IEN7
#define IEN_PERIA_INTA224       IEN0
#define IEN_PERIA_INTA225       IEN1
#define IEN_PERIA_INTA226       IEN2
#define IEN_PERIA_INTA227       IEN3
#define IEN_PERIA_INTA228       IEN4
#define IEN_PERIA_INTA229       IEN5
#define IEN_PERIA_INTA230       IEN6
#define IEN_PERIA_INTA231       IEN7
#define IEN_PERIA_INTA232       IEN0
#define IEN_PERIA_INTA233       IEN1
#define IEN_PERIA_INTA234       IEN2
#define IEN_PERIA_INTA235       IEN3
#define IEN_PERIA_INTA236       IEN4
#define IEN_PERIA_INTA237       IEN5
#define IEN_PERIA_INTA238       IEN6
#define IEN_PERIA_INTA239       IEN7
#define IEN_PERIA_INTA240       IEN0
#define IEN_PERIA_INTA241       IEN1
#define IEN_PERIA_INTA242       IEN2
#define IEN_PERIA_INTA243       IEN3
#define IEN_PERIA_INTA244       IEN4
#define IEN_PERIA_INTA245       IEN5
#define IEN_PERIA_INTA246       IEN6
#define IEN_PERIA_INTA247       IEN7
#define IEN_PERIA_INTA248       IEN0
#define IEN_PERIA_INTA249       IEN1
#define IEN_PERIA_INTA250       IEN2
#define IEN_PERIA_INTA251       IEN3
#define IEN_PERIA_INTA252       IEN4
#define IEN_PERIA_INTA253       IEN5
#define IEN_PERIA_INTA254       IEN6
#define IEN_PERIA_INTA255       IEN7

#define VECT_BSC_BUSERR         16
#define VECT_RAM_RAMERR         18
#define VECT_FCU_FIFERR         21
#define VECT_FCU_FRDYI          23
#define VECT_ICU_SWINT2         26
#define VECT_ICU_SWINT          27
#define VECT_CMT0_CMI0          28
#define VECT_CMT1_CMI1          29
#define VECT_CMTW0_CMWI0        30
#define VECT_CMTW1_CMWI1        31
#define VECT_USBA_D0FIFO2       32
#define VECT_USBA_D1FIFO2       33
#define VECT_USB0_D0FIFO0       34
#define VECT_USB0_D1FIFO0       35
#define VECT_RSPI0_SPRI0        38
#define VECT_RSPI0_SPTI0        39
#define VECT_RSPI1_SPRI1        40
#define VECT_RSPI1_SPTI1        41
#define VECT_QSPI_SPRI          42
#define VECT_QSPI_SPTI          43
#define VECT_SDHI_SBFAI         44
#define VECT_MMCIF_MBFAI        45
#define VECT_SSI0_SSITXI0       46
#define VECT_SSI0_SSIRXI0       47
#define VECT_SSI1_SSIRTI1       48
#define VECT_SRC_IDEI           50
#define VECT_SRC_ODFI           51
#define VECT_RIIC0_RXI0         52
#define VECT_RIIC0_TXI0         53
#define VECT_RIIC2_RXI2         54
#define VECT_RIIC2_TXI2         55
#define VECT_SCI0_RXI0          58
#define VECT_SCI0_TXI0          59
#define VECT_SCI1_RXI1          60
#define VECT_SCI1_TXI1          61
#define VECT_SCI2_RXI2          62
#define VECT_SCI2_TXI2          63
#define VECT_ICU_IRQ0           64
#define VECT_ICU_IRQ1           65
#define VECT_ICU_IRQ2           66
#define VECT_ICU_IRQ3           67
#define VECT_ICU_IRQ4           68
#define VECT_ICU_IRQ5           69
#define VECT_ICU_IRQ6           70
#define VECT_ICU_IRQ7           71
#define VECT_ICU_IRQ8           72
#define VECT_ICU_IRQ9           73
#define VECT_ICU_IRQ10          74
#define VECT_ICU_IRQ11          75
#define VECT_ICU_IRQ12          76
#define VECT_ICU_IRQ13          77
#define VECT_ICU_IRQ14          78
#define VECT_ICU_IRQ15          79
#define VECT_SCI3_RXI3          80
#define VECT_SCI3_TXI3          81
#define VECT_SCI4_RXI4          82
#define VECT_SCI4_TXI4          83
#define VECT_SCI5_RXI5          84
#define VECT_SCI5_TXI5          85
#define VECT_SCI6_RXI6          86
#define VECT_SCI6_TXI6          87
#define VECT_LVD1_LVD1          88
#define VECT_LVD2_LVD2          89
#define VECT_USB0_USBR0         90
#define VECT_RTC_ALM            92
#define VECT_RTC_PRD            93
#define VECT_USBA_USBAR         94
#define VECT_IWDT_IWUNI         95
#define VECT_WDT_WUNI           96
#define VECT_PDC_PCDFI          97
#define VECT_SCI7_RXI7          98
#define VECT_SCI7_TXI7          99
#define VECT_SCIFA8_RXIF8       100
#define VECT_SCIFA8_TXIF8       101
#define VECT_SCIFA9_RXIF9       102
#define VECT_SCIFA9_TXIF9       103
#define VECT_SCIFA10_RXIF10     104
#define VECT_SCIFA10_TXIF10     105
#define VECT_ICU_GROUPBE0       106
#define VECT_ICU_GROUPBL0       110
#define VECT_ICU_GROUPBL1       111
#define VECT_ICU_GROUPAL0       112
#define VECT_ICU_GROUPAL1       113
#define VECT_SCIFA11_RXIF11     114
#define VECT_SCIFA11_TXIF11     115
#define VECT_SCI12_RXI12        116
#define VECT_SCI12_TXI12        117
#define VECT_DMAC_DMAC0I        120
#define VECT_DMAC_DMAC1I        121
#define VECT_DMAC_DMAC2I        122
#define VECT_DMAC_DMAC3I        123
#define VECT_DMAC_DMAC74I       124
#define VECT_OST_OST            125
#define VECT_EXDMAC_EXDMAC0I    126
#define VECT_EXDMAC_EXDMAC1I    127
#define VECT_PERIB_INTB128      128
#define VECT_PERIB_INTB129      129
#define VECT_PERIB_INTB130      130
#define VECT_PERIB_INTB131      131
#define VECT_PERIB_INTB132      132
#define VECT_PERIB_INTB133      133
#define VECT_PERIB_INTB134      134
#define VECT_PERIB_INTB135      135
#define VECT_PERIB_INTB136      136
#define VECT_PERIB_INTB137      137
#define VECT_PERIB_INTB138      138
#define VECT_PERIB_INTB139      139
#define VECT_PERIB_INTB140      140
#define VECT_PERIB_INTB141      141
#define VECT_PERIB_INTB142      142
#define VECT_PERIB_INTB143      143
#define VECT_PERIB_INTB144      144
#define VECT_PERIB_INTB145      145
#define VECT_PERIB_INTB146      146
#define VECT_PERIB_INTB147      147
#define VECT_PERIB_INTB148      148
#define VECT_PERIB_INTB149      149
#define VECT_PERIB_INTB150      150
#define VECT_PERIB_INTB151      151
#define VECT_PERIB_INTB152      152
#define VECT_PERIB_INTB153      153
#define VECT_PERIB_INTB154      154
#define VECT_PERIB_INTB155      155
#define VECT_PERIB_INTB156      156
#define VECT_PERIB_INTB157      157
#define VECT_PERIB_INTB158      158
#define VECT_PERIB_INTB159      159
#define VECT_PERIB_INTB160      160
#define VECT_PERIB_INTB161      161
#define VECT_PERIB_INTB162      162
#define VECT_PERIB_INTB163      163
#define VECT_PERIB_INTB164      164
#define VECT_PERIB_INTB165      165
#define VECT_PERIB_INTB166      166
#define VECT_PERIB_INTB167      167
#define VECT_PERIB_INTB168      168
#define VECT_PERIB_INTB169      169
#define VECT_PERIB_INTB170      170
#define VECT_PERIB_INTB171      171
#define VECT_PERIB_INTB172      172
#define VECT_PERIB_INTB173      173
#define VECT_PERIB_INTB174      174
#define VECT_PERIB_INTB175      175
#define VECT_PERIB_INTB176      176
#define VECT_PERIB_INTB177      177
#define VECT_PERIB_INTB178      178
#define VECT_PERIB_INTB179      179
#define VECT_PERIB_INTB180      180
#define VECT_PERIB_INTB181      181
#define VECT_PERIB_INTB182      182
#define VECT_PERIB_INTB183      183
#define VECT_PERIB_INTB184      184
#define VECT_PERIB_INTB185      185
#define VECT_PERIB_INTB186      186
#define VECT_PERIB_INTB187      187
#define VECT_PERIB_INTB188      188
#define VECT_PERIB_INTB189      189
#define VECT_PERIB_INTB190      190
#define VECT_PERIB_INTB191      191
#define VECT_PERIB_INTB192      192
#define VECT_PERIB_INTB193      193
#define VECT_PERIB_INTB194      194
#define VECT_PERIB_INTB195      195
#define VECT_PERIB_INTB196      196
#define VECT_PERIB_INTB197      197
#define VECT_PERIB_INTB198      198
#define VECT_PERIB_INTB199      199
#define VECT_PERIB_INTB200      200
#define VECT_PERIB_INTB201      201
#define VECT_PERIB_INTB202      202
#define VECT_PERIB_INTB203      203
#define VECT_PERIB_INTB204      204
#define VECT_PERIB_INTB205      205
#define VECT_PERIB_INTB206      206
#define VECT_PERIB_INTB207      207
#define VECT_PERIA_INTA208      208
#define VECT_PERIA_INTA209      209
#define VECT_PERIA_INTA210      210
#define VECT_PERIA_INTA211      211
#define VECT_PERIA_INTA212      212
#define VECT_PERIA_INTA213      213
#define VECT_PERIA_INTA214      214
#define VECT_PERIA_INTA215      215
#define VECT_PERIA_INTA216      216
#define VECT_PERIA_INTA217      217
#define VECT_PERIA_INTA218      218
#define VECT_PERIA_INTA219      219
#define VECT_PERIA_INTA220      220
#define VECT_PERIA_INTA221      221
#define VECT_PERIA_INTA222      222
#define VECT_PERIA_INTA223      223
#define VECT_PERIA_INTA224      224
#define VECT_PERIA_INTA225      225
#define VECT_PERIA_INTA226      226
#define VECT_PERIA_INTA227      227
#define VECT_PERIA_INTA228      228
#define VECT_PERIA_INTA229      229
#define VECT_PERIA_INTA230      230
#define VECT_PERIA_INTA231      231
#define VECT_PERIA_INTA232      232
#define VECT_PERIA_INTA233      233
#define VECT_PERIA_INTA234      234
#define VECT_PERIA_INTA235      235
#define VECT_PERIA_INTA236      236
#define VECT_PERIA_INTA237      237
#define VECT_PERIA_INTA238      238
#define VECT_PERIA_INTA239      239
#define VECT_PERIA_INTA240      240
#define VECT_PERIA_INTA241      241
#define VECT_PERIA_INTA242      242
#define VECT_PERIA_INTA243      243
#define VECT_PERIA_INTA244      244
#define VECT_PERIA_INTA245      245
#define VECT_PERIA_INTA246      246
#define VECT_PERIA_INTA247      247
#define VECT_PERIA_INTA248      248
#define VECT_PERIA_INTA249      249
#define VECT_PERIA_INTA250      250
#define VECT_PERIA_INTA251      251
#define VECT_PERIA_INTA252      252
#define VECT_PERIA_INTA253      253
#define VECT_PERIA_INTA254      254
#define VECT_PERIA_INTA255      255

#define MSTP_EXDMAC             SYSTEM.MSTPCRA.BIT.MSTPA29
#define MSTP_EXDMAC0            SYSTEM.MSTPCRA.BIT.MSTPA29
#define MSTP_EXDMAC1            SYSTEM.MSTPCRA.BIT.MSTPA29
#define MSTP_DMAC               SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC0              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC1              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC2              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC3              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC4              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC5              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC6              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC7              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DTC                SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DA                 SYSTEM.MSTPCRA.BIT.MSTPA19
#define MSTP_S12AD              SYSTEM.MSTPCRA.BIT.MSTPA17
#define MSTP_S12AD1             SYSTEM.MSTPCRA.BIT.MSTPA16
#define MSTP_CMT0               SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT1               SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT2               SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_CMT3               SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_TPU0               SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU1               SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU2               SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU3               SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU4               SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU5               SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_PPG0               SYSTEM.MSTPCRA.BIT.MSTPA11
#define MSTP_PPG1               SYSTEM.MSTPCRA.BIT.MSTPA10
#define MSTP_MTU                SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU0               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU1               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU2               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU3               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU4               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU5               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU6               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU7               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU8               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_GPT                SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT0               SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT1               SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT2               SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT3               SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_TMR0               SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR1               SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR01              SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR2               SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_TMR3               SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_TMR23              SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_CMTW0              SYSTEM.MSTPCRA.BIT.MSTPA1
#define MSTP_CMTW1              SYSTEM.MSTPCRA.BIT.MSTPA0
#define MSTP_SCI0               SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SMCI0              SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SCI1               SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_SMCI1              SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_SCI2               SYSTEM.MSTPCRB.BIT.MSTPB29
#define MSTP_SMCI2              SYSTEM.MSTPCRB.BIT.MSTPB29
#define MSTP_SCI3               SYSTEM.MSTPCRB.BIT.MSTPB28
#define MSTP_SMCI3              SYSTEM.MSTPCRB.BIT.MSTPB28
#define MSTP_SCI4               SYSTEM.MSTPCRB.BIT.MSTPB27
#define MSTP_SMCI4              SYSTEM.MSTPCRB.BIT.MSTPB27
#define MSTP_SCI5               SYSTEM.MSTPCRB.BIT.MSTPB26
#define MSTP_SMCI5              SYSTEM.MSTPCRB.BIT.MSTPB26
#define MSTP_SCI6               SYSTEM.MSTPCRB.BIT.MSTPB25
#define MSTP_SMCI6              SYSTEM.MSTPCRB.BIT.MSTPB25
#define MSTP_SCI7               SYSTEM.MSTPCRB.BIT.MSTPB24
#define MSTP_SMCI7              SYSTEM.MSTPCRB.BIT.MSTPB24
#define MSTP_CRC                SYSTEM.MSTPCRB.BIT.MSTPB23
#define MSTP_PDC                SYSTEM.MSTPCRB.BIT.MSTPB22
#define MSTP_RIIC0              SYSTEM.MSTPCRB.BIT.MSTPB21
#define MSTP_USB0               SYSTEM.MSTPCRB.BIT.MSTPB19
#define MSTP_RSPI0              SYSTEM.MSTPCRB.BIT.MSTPB17
#define MSTP_RSPI1              SYSTEM.MSTPCRB.BIT.MSTPB16
#define MSTP_EDMAC0             SYSTEM.MSTPCRB.BIT.MSTPB15
#define MSTP_EDMAC1             SYSTEM.MSTPCRB.BIT.MSTPB14
#define MSTP_USBA               SYSTEM.MSTPCRB.BIT.MSTPB12
#define MSTP_ELC                SYSTEM.MSTPCRB.BIT.MSTPB9
#define MSTP_TEMPS              SYSTEM.MSTPCRB.BIT.MSTPB8
#define MSTP_DOC                SYSTEM.MSTPCRB.BIT.MSTPB6
#define MSTP_SCI12              SYSTEM.MSTPCRB.BIT.MSTPB4
#define MSTP_SMCI12             SYSTEM.MSTPCRB.BIT.MSTPB4
#define MSTP_CAN2               SYSTEM.MSTPCRB.BIT.MSTPB2
#define MSTP_CAN1               SYSTEM.MSTPCRB.BIT.MSTPB1
#define MSTP_CAN0               SYSTEM.MSTPCRB.BIT.MSTPB0
#define MSTP_SCIFA8             SYSTEM.MSTPCRC.BIT.MSTPC27
#define MSTP_SCIFA9             SYSTEM.MSTPCRC.BIT.MSTPC26
#define MSTP_SCIFA10            SYSTEM.MSTPCRC.BIT.MSTPC25
#define MSTP_SCIFA11            SYSTEM.MSTPCRC.BIT.MSTPC24
#define MSTP_QSPI               SYSTEM.MSTPCRC.BIT.MSTPC23
#define MSTP_CAC                SYSTEM.MSTPCRC.BIT.MSTPC19
#define MSTP_RIIC2              SYSTEM.MSTPCRC.BIT.MSTPC17
#define MSTP_STBYRAM            SYSTEM.MSTPCRC.BIT.MSTPC7
#define MSTP_ECCRAM             SYSTEM.MSTPCRC.BIT.MSTPC6
#define MSTP_RAM0               SYSTEM.MSTPCRC.BIT.MSTPC0
#define MSTP_SRC                SYSTEM.MSTPCRD.BIT.MSTPD23
#define MSTP_MMCIF              SYSTEM.MSTPCRD.BIT.MSTPD21
#define MSTP_SDHI               SYSTEM.MSTPCRD.BIT.MSTPD19
#define MSTP_SSI0               SYSTEM.MSTPCRD.BIT.MSTPD15
#define MSTP_SSI1               SYSTEM.MSTPCRD.BIT.MSTPD14

