FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX71M_RSK_Renesas_e2studio/src/iodefine.h
#define IS_CAN0_ERS0            IS0
#define IS_CAN1_ERS1            IS1
#define IS_CAN2_ERS2            IS2
#define IS_SCI0_TEI0            IS0
#define IS_SCI0_ERI0            IS1
#define IS_SCI1_TEI1            IS2
#define IS_SCI1_ERI1            IS3
#define IS_SCI2_TEI2            IS4
#define IS_SCI2_ERI2            IS5
#define IS_SCI3_TEI3            IS6
#define IS_SCI3_ERI3            IS7
#define IS_SCI4_TEI4            IS8
#define IS_SCI4_ERI4            IS9
#define IS_SCI5_TEI5            IS10
#define IS_SCI5_ERI5            IS11
#define IS_SCI6_TEI6            IS12
#define IS_SCI6_ERI6            IS13
#define IS_SCI7_TEI7            IS14
#define IS_SCI7_ERI7            IS15
#define IS_SCI12_TEI12          IS16
#define IS_SCI12_ERI12          IS17
#define IS_SCI12_SCIX0          IS18
#define IS_SCI12_SCIX1          IS19
#define IS_SCI12_SCIX2          IS20
#define IS_SCI12_SCIX3          IS21
#define IS_QSPI_QSPSSLI         IS24
#define IS_CAC_FERRF            IS26
#define IS_CAC_MENDF            IS27
#define IS_CAC_OVFF             IS28
#define IS_DOC_DOPCF            IS29
#define IS_PDC_PCFEI            IS30
#define IS_PDC_PCERI            IS31
#define IS_SRC_PCERI            IS0
#define IS_SRC_OVF              IS1
#define IS_SRC_CEF              IS2
#define IS_SDHI_CDETI           IS3
#define IS_SDHI_CACI            IS4
#define IS_SDHI_SDACI           IS5
#define IS_MMCIF_CDETIO         IS6
#define IS_MMCIF_ERRIO          IS7
#define IS_MMCIF_ACCIO          IS8
#define IS_POE3_OEI1            IS9
#define IS_POE3_OEI2            IS10
#define IS_POE3_OEI3            IS11
#define IS_POE3_OEI4            IS12
#define IS_RIIC0_TEI0           IS13
#define IS_RIIC0_EEI0           IS14
#define IS_RIIC2_TEI2           IS15
#define IS_RIIC2_EEI2           IS16
#define IS_SSI0_SSIF0           IS17
#define IS_SSI1_SSIF1           IS18
#define IS_S12AD0_S12CMPI0      IS20
#define IS_S12AD1_S12CMPI1      IS22
#define IS_SCIFA8_TEIF8         IS0
#define IS_SCIFA8_ERIF8         IS1
#define IS_SCIFA8_BRIF8         IS2
#define IS_SCIFA8_DRIF8         IS3
#define IS_SCIFA9_TEIF9         IS4
#define IS_SCIFA9_ERIF9         IS5
#define IS_SCIFA9_BRIF9         IS6
#define IS_SCIFA9_DRIF9         IS7
#define IS_SCIFA10_TEIF10       IS8
#define IS_SCIFA10_ERIF10       IS9
#define IS_SCIFA10_BRIF10       IS10
#define IS_SCIFA10_DRIF10       IS11
#define IS_SCIFA11_TEIF11       IS12
#define IS_SCIFA11_ERIF11       IS13
#define IS_SCIFA11_BRIF11       IS14
#define IS_SCIFA11_DRIF11       IS15
#define IS_RSPI0_SPII0          IS16
#define IS_RSPI0_SPEI0          IS17
#define IS_RSPI1_SPII1          IS18
#define IS_RSPI1_SPEI1          IS19
#define IS_EPTPC_MINT           IS0
#define IS_PRPEDMAC_PINT        IS1
#define IS_EDMAC0_EINT0         IS4
#define IS_EDMAC1_EINT1         IS5

#define EN_CAN0_ERS0            EN0
#define EN_CAN1_ERS1            EN1
#define EN_CAN2_ERS2            EN2
#define EN_SCI0_TEI0            EN0
#define EN_SCI0_ERI0            EN1
#define EN_SCI1_TEI1            EN2
#define EN_SCI1_ERI1            EN3
#define EN_SCI2_TEI2            EN4
#define EN_SCI2_ERI2            EN5
#define EN_SCI3_TEI3            EN6
#define EN_SCI3_ERI3            EN7
#define EN_SCI4_TEI4            EN8
#define EN_SCI4_ERI4            EN9
#define EN_SCI5_TEI5            EN10
#define EN_SCI5_ERI5            EN11
#define EN_SCI6_TEI6            EN12
#define EN_SCI6_ERI6            EN13
#define EN_SCI7_TEI7            EN14
#define EN_SCI7_ERI7            EN15
#define EN_SCI12_TEI12          EN16
#define EN_SCI12_ERI12          EN17
#define EN_SCI12_SCIX0          EN18
#define EN_SCI12_SCIX1          EN19
#define EN_SCI12_SCIX2          EN20
#define EN_SCI12_SCIX3          EN21
#define EN_QSPI_QSPSSLI         EN24
#define EN_CAC_FERRF            EN26
#define EN_CAC_MENDF            EN27
#define EN_CAC_OVFF             EN28
#define EN_DOC_DOPCF            EN29
#define EN_PDC_PCFEI            EN30
#define EN_PDC_PCERI            EN31
#define EN_SRC_PCERI            EN0
#define EN_SRC_OVF              EN1
#define EN_SRC_CEF              EN2
#define EN_SDHI_CDETI           EN3
#define EN_SDHI_CACI            EN4
#define EN_SDHI_SDACI           EN5
#define EN_MMCIF_CDETIO         EN6
#define EN_MMCIF_ERRIO          EN7
#define EN_MMCIF_ACCIO          EN8
#define EN_POE3_OEI1            EN9
#define EN_POE3_OEI2            EN10
#define EN_POE3_OEI3            EN11
#define EN_POE3_OEI4            EN12
#define EN_RIIC0_TEI0           EN13
#define EN_RIIC0_EEI0           EN14
#define EN_RIIC2_TEI2           EN15
#define EN_RIIC2_EEI2           EN16
#define EN_SSI0_SSIF0           EN17
#define EN_SSI1_SSIF1           EN18
#define EN_S12AD0_S12CMPI0      EN20
#define EN_S12AD1_S12CMPI1      EN22
#define EN_SCIFA8_TEIF8         EN0
#define EN_SCIFA8_ERIF8         EN1
#define EN_SCIFA8_BRIF8         EN2
#define EN_SCIFA8_DRIF8         EN3
#define EN_SCIFA9_TEIF9         EN4
#define EN_SCIFA9_ERIF9         EN5
#define EN_SCIFA9_BRIF9         EN6
#define EN_SCIFA9_DRIF9         EN7
#define EN_SCIFA10_TEIF10       EN8
#define EN_SCIFA10_ERIF10       EN9
#define EN_SCIFA10_BRIF10       EN10
#define EN_SCIFA10_DRIF10       EN11
#define EN_SCIFA11_TEIF11       EN12
#define EN_SCIFA11_ERIF11       EN13
#define EN_SCIFA11_BRIF11       EN14
#define EN_SCIFA11_DRIF11       EN15
#define EN_RSPI0_SPII0          EN16
#define EN_RSPI0_SPEI0          EN17
#define EN_RSPI1_SPII1          EN18
#define EN_RSPI1_SPEI1          EN19
#define EN_EPTPC_MINT           EN0
#define EN_PRPEDMAC_PINT        EN1
#define EN_EDMAC0_EINT0         EN4
#define EN_EDMAC1_EINT1         EN5

#define CLR_CAN0_ERS0           CLR0
#define CLR_CAN1_ERS1           CLR1
#define CLR_CAN2_ERS2           CLR2
#define CLR_RSPI1_SPII1         CLR18
#define CLR_RSPI1_SPEI1         CLR19

#define GEN_CAN0_ERS0           GENBE0
#define GEN_CAN1_ERS1           GENBE0
#define GEN_CAN2_ERS2           GENBE0
#define GEN_SCI0_TEI0           GENBL0
#define GEN_SCI0_ERI0           GENBL0
#define GEN_SCI1_TEI1           GENBL0
#define GEN_SCI1_ERI1           GENBL0
#define GEN_SCI2_TEI2           GENBL0
#define GEN_SCI2_ERI2           GENBL0
#define GEN_SCI3_TEI3           GENBL0
#define GEN_SCI3_ERI3           GENBL0
#define GEN_SCI4_TEI4           GENBL0
#define GEN_SCI4_ERI4           GENBL0
#define GEN_SCI5_TEI5           GENBL0
#define GEN_SCI5_ERI5           GENBL0
#define GEN_SCI6_TEI6           GENBL0
#define GEN_SCI6_ERI6           GENBL0
#define GEN_SCI7_TEI7           GENBL0
#define GEN_SCI7_ERI7           GENBL0
#define GEN_SCI12_TEI12         GENBL0
#define GEN_SCI12_ERI12         GENBL0
#define GEN_SCI12_SCIX0         GENBL0
#define GEN_SCI12_SCIX1         GENBL0
#define GEN_SCI12_SCIX2         GENBL0
#define GEN_SCI12_SCIX3         GENBL0
#define GEN_QSPI_QSPSSLI        GENBL0
#define GEN_CAC_FERRF           GENBL0
#define GEN_CAC_MENDF           GENBL0
#define GEN_CAC_OVFF            GENBL0
#define GEN_DOC_DOPCF           GENBL0
#define GEN_PDC_PCFEI           GENBL0
#define GEN_PDC_PCERI           GENBL0
#define GEN_SRC_PCERI           GENBL1
#define GEN_SRC_OVF             GENBL1
#define GEN_SRC_CEF             GENBL1
#define GEN_SDHI_CDETI          GENBL1
#define GEN_SDHI_CACI           GENBL1
#define GEN_SDHI_SDACI          GENBL1
#define GEN_MMCIF_CDETIO        GENBL1
#define GEN_MMCIF_ERRIO         GENBL1
#define GEN_MMCIF_ACCIO         GENBL1
#define GEN_POE3_OEI1           GENBL1
#define GEN_POE3_OEI2           GENBL1
#define GEN_POE3_OEI3           GENBL1
#define GEN_POE3_OEI4           GENBL1
#define GEN_RIIC0_TEI0          GENBL1
#define GEN_RIIC0_EEI0          GENBL1
#define GEN_RIIC2_TEI2          GENBL1
#define GEN_RIIC2_EEI2          GENBL1
#define GEN_SSI0_SSIF0          GENBL1
#define GEN_SSI1_SSIF1          GENBL1
#define GEN_S12AD0_S12CMPI0     GENBL1
#define GEN_S12AD1_S12CMPI1     GENBL1
#define GEN_SCIFA8_TEIF8        GENAL0
#define GEN_SCIFA8_ERIF8        GENAL0
#define GEN_SCIFA8_BRIF8        GENAL0
#define GEN_SCIFA8_DRIF8        GENAL0
#define GEN_SCIFA9_TEIF9        GENAL0
#define GEN_SCIFA9_ERIF9        GENAL0
#define GEN_SCIFA9_BRIF9        GENAL0
#define GEN_SCIFA9_DRIF9        GENAL0
#define GEN_SCIFA10_TEIF10      GENAL0
#define GEN_SCIFA10_ERIF10      GENAL0
#define GEN_SCIFA10_BRIF10      GENAL0
#define GEN_SCIFA10_DRIF10      GENAL0
#define GEN_SCIFA11_TEIF11      GENAL0
#define GEN_SCIFA11_ERIF11      GENAL0
#define GEN_SCIFA11_BRIF11      GENAL0
#define GEN_SCIFA11_DRIF11      GENAL0
#define GEN_RSPI0_SPII0         GENAL0
#define GEN_RSPI0_SPEI0         GENAL0
#define GEN_RSPI1_SPII1         GENAL0
#define GEN_RSPI1_SPEI1         GENAL0
#define GEN_EPTPC_MINT          GENAL1
#define GEN_PRPEDMAC_PINT       GENAL1
#define GEN_EDMAC0_EINT0        GENAL1
#define GEN_EDMAC1_EINT1        GENAL1

#define GRP_CAN0_ERS0           GRPBE0
#define GRP_CAN1_ERS1           GRPBE0
#define GRP_CAN2_ERS2           GRPBE0
#define GRP_SCI0_TEI0           GRPBL0
#define GRP_SCI0_ERI0           GRPBL0
#define GRP_SCI1_TEI1           GRPBL0
#define GRP_SCI1_ERI1           GRPBL0
#define GRP_SCI2_TEI2           GRPBL0
#define GRP_SCI2_ERI2           GRPBL0
#define GRP_SCI3_TEI3           GRPBL0
#define GRP_SCI3_ERI3           GRPBL0
#define GRP_SCI4_TEI4           GRPBL0
#define GRP_SCI4_ERI4           GRPBL0
#define GRP_SCI5_TEI5           GRPBL0
#define GRP_SCI5_ERI5           GRPBL0
#define GRP_SCI6_TEI6           GRPBL0
#define GRP_SCI6_ERI6           GRPBL0
#define GRP_SCI7_TEI7           GRPBL0
#define GRP_SCI7_ERI7           GRPBL0
#define GRP_SCI12_TEI12         GRPBL0
#define GRP_SCI12_ERI12         GRPBL0
#define GRP_SCI12_SCIX0         GRPBL0
#define GRP_SCI12_SCIX1         GRPBL0
#define GRP_SCI12_SCIX2         GRPBL0
#define GRP_SCI12_SCIX3         GRPBL0
#define GRP_QSPI_QSPSSLI        GRPBL0
#define GRP_CAC_FERRF           GRPBL0
#define GRP_CAC_MENDF           GRPBL0
#define GRP_CAC_OVFF            GRPBL0
#define GRP_DOC_DOPCF           GRPBL0
#define GRP_PDC_PCFEI           GRPBL0
#define GRP_PDC_PCERI           GRPBL0
#define GRP_SRC_PCERI           GRPBL1
#define GRP_SRC_OVF             GRPBL1
#define GRP_SRC_CEF             GRPBL1
#define GRP_SDHI_CDETI          GRPBL1
#define GRP_SDHI_CACI           GRPBL1
#define GRP_SDHI_SDACI          GRPBL1
#define GRP_MMCIF_CDETIO        GRPBL1
#define GRP_MMCIF_ERRIO         GRPBL1
#define GRP_MMCIF_ACCIO         GRPBL1
#define GRP_POE3_OEI1           GRPBL1
#define GRP_POE3_OEI2           GRPBL1
#define GRP_POE3_OEI3           GRPBL1
#define GRP_POE3_OEI4           GRPBL1
#define GRP_RIIC0_TEI0          GRPBL1
#define GRP_RIIC0_EEI0          GRPBL1
#define GRP_RIIC2_TEI2          GRPBL1
#define GRP_RIIC2_EEI2          GRPBL1
#define GRP_SSI0_SSIF0          GRPBL1
#define GRP_SSI1_SSIF1          GRPBL1
#define GRP_S12AD0_S12CMPI0     GRPBL1
#define GRP_S12AD1_S12CMPI1     GRPBL1
#define GRP_SCIFA8_TEIF8        GRPAL0
#define GRP_SCIFA8_ERIF8        GRPAL0
#define GRP_SCIFA8_BRIF8        GRPAL0
#define GRP_SCIFA8_DRIF8        GRPAL0
#define GRP_SCIFA9_TEIF9        GRPAL0
#define GRP_SCIFA9_ERIF9        GRPAL0
#define GRP_SCIFA9_BRIF9        GRPAL0
#define GRP_SCIFA9_DRIF9        GRPAL0
#define GRP_SCIFA10_TEIF10      GRPAL0
#define GRP_SCIFA10_ERIF10      GRPAL0
#define GRP_SCIFA10_BRIF10      GRPAL0
#define GRP_SCIFA10_DRIF10      GRPAL0
#define GRP_SCIFA11_TEIF11      GRPAL0
#define GRP_SCIFA11_ERIF11      GRPAL0
#define GRP_SCIFA11_BRIF11      GRPAL0
#define GRP_SCIFA11_DRIF11      GRPAL0
#define GRP_RSPI0_SPII0         GRPAL0
#define GRP_RSPI0_SPEI0         GRPAL0
#define GRP_RSPI1_SPII1         GRPAL0
#define GRP_RSPI1_SPEI1         GRPAL0
#define GRP_EPTPC_MINT          GRPAL1
#define GRP_PRPEDMAC_PINT       GRPAL1
#define GRP_EDMAC0_EINT0        GRPAL1
#define GRP_EDMAC1_EINT1        GRPAL1

#define GCR_CAN0_ERS0           GCRBE0
#define GCR_CAN1_ERS1           GCRBE0
#define GCR_CAN2_ERS2           GCRBE0
#define GCR_RSPI1_SPII1         GCRAL0
#define GCR_RSPI1_SPEI1         GCRAL0

